[
    {
        "16": [
            {
                "title": "Alcoa CEO appeals to Trump administration to drop tariffs on Canadian aluminum imports",
                "description": "Canada is by far the biggest foreign supplier to the U.S., accounting for 2.9 million tonnes a year",
                "content": "Open this photo in gallery: Alcoa's Becancour aluminum smelter is seen in Becancour, Que., on Feb. 10.Bernard Brault/Reuters\nAlcoa Corp. chief executive William Oplinger is appealing to U.S. President Donald Trump to drop his aluminum tariffs on Cana... [3593 chars]"
            },
            {
                "title": "Nvidia Faces More Disruption From New China Export Curbs Than Expected, Morgan Stanley Says",
                "description": "Morgan Stanley analysts on Wednesday trimmed their revenue projections for Nvidia, citing concerns new chip export curbs to China are “more disruptive” than anticipated.",
                "content": "Key Takeaways Morgan Stanley analysts on Wednesday trimmed their revenue projections for Nvidia, citing concerns new chip export curbs to China are “more disruptive” than anticipated.\nNvidia on Tuesday said it expects to take a $5.5 billion charge in... [2743 chars]"
            },
            {
                "title": "Premiers Kinew, Akeeagok ink deal to build hydro transmission line from Manitoba to Nunavut",
                "description": "Manitoba Premier Wab Kinew and Nunavut Premier P.J. Akeeagok have signed a memorandum to work together on a proposed hydroelectric and fibre optic project and ask Ottawa for capital funding.",
                "content": "The premiers of Manitoba and Nunavut are hopeful a proposed hydroelectric and fibre optic project is moving closer to fruition, and are seeking federal money.\nManitoba Premier Wab Kinew and Nunavut Premier P.J. Akeeagok have signed a memorandum to wo... [2525 chars]"
            },
            {
                "title": "CardUp offering Mastercard income tax payments with 1.55-1.67% fees",
                "description": "CardUp users can pay income taxes with a Mastercard and fees from 1.55%, reducing the cost per mile to as low as 0.76 cents. Redemption and payment caps apply.",
                "content": "CardUp is launching a new promotion for income tax payments made with a Mastercard, offering a reduced fee of 1.55% for new customers, and 1.67% for existing customers.\nThis brings the cost per mile down to as little as 0.76 cents—currently the best ... [8512 chars]"
            },
            {
                "title": "B.C. gov't to remove second driver's test, introduce wait period for new licensing",
                "description": "The B.C. government is working to streamline its graduated driver licensing process by eliminating the requirement for a second road test.",
                "content": "The B.C. government is working to streamline its graduated driver licensing process by eliminating the requirement for a second road test and extending the restriction period for new drivers.\nOn Wednesday, the province announced it is introducing leg... [3146 chars]"
            },
            {
                "title": "DeepSeek Poses 'Profound' Security Threat, US House Panel Claims",
                "description": "Chinese artificial intelligence firm DeepSeek is a “profound threat” to US national security, a bipartisan House committee said, urging Nvidia Corp. to hand over information on sales of chips that the startup may have used to develop its breakthrough chatbot model.",
                "content": "Chinese artificial intelligence firm DeepSeek is a “profound threat” to US national security, a bipartisan House committee said, urging Nvidia Corp. to hand over information on sales of chips that the startup may have used to develop its breakthrough... [439 chars]"
            },
            {
                "title": "PSX ends two-day rally on profit-taking",
                "description": "Late-session selling drags KSE-100 down by 755 points to below 116,100",
                "content": "Listen to article\nThe Pakistan Stock Exchange (PSX) ended lower on Wednesday, snapping a two-day winning streak, as the benchmark KSE-100 index fell around 750 points on the back of profit-taking at higher levels.\nDespite the early momentum that push... [3804 chars]"
            },
            {
                "title": "Lawmakers Say DeepSeek Spying for China, Nvidia Probed Over Chips",
                "description": "US lawmakers accused DeepSeek of spying for China and said they are looking into how Nvidia chips may have been obtained by the Chinese AI company.",
                "content": "US lawmakers are looking into how DeepSeek may have gotten Nvidia chips.\nUS lawmakers are looking into how DeepSeek may have gotten Nvidia chips. Jakub Porzycki/NurPhoto via Getty Images\nThis story is available exclusively to Business Insider subscri... [3404 chars]"
            },
            {
                "title": "Court Grants Final Order to Converge Approving Acquisition by H.I.G. Capital",
                "description": "/PRNewswire/ -- Converge Technology Solutions Corp. (\"Converge\" or the \"Company\") (TSX: CTS) (FSE: 0ZB) (OTCQX: CTSDF) announced today that the Ontario...",
                "content": "TORONTO and GATINEAU, QC, April 17, 2025 /PRNewswire/ -- Converge Technology Solutions Corp. (\"Converge\" or the \"Company\") (TSX: CTS) (FSE: 0ZB) (OTCQX: CTSDF) announced today that the Ontario Superior Court of Justice (Commercial List) has issued a ... [6063 chars]"
            },
            {
                "title": "Hamilton Locke Recognised in the 2026 Edition of Best Lawyers in Australia",
                "description": "Hamilton Locke has been recognised once again in the 18th edition of The Best Lawyers in Australia report, including the prestigious Best Lawyers: One to Watch list. In the 2026 edition, 22 Hamilton Locke partners have been acknowledged for their excellence across 25 distinct practice areas, reflecting the depth and breadth of talent within our",
                "content": "Hamilton Locke has been recognised once again in the 18th edition of The Best Lawyers in Australia report, including the prestigious Best Lawyers: One to Watch list.\nIn the 2026 edition, 22 Hamilton Locke partners have been acknowledged for their exc... [2771 chars]"
            }
        ]
    },
    {
        "15": [
            {
                "title": "California attorney general declines to join Musk's lawsuit against OpenAI",
                "description": "SAN FRANCISCO : The California attorney general's office declined to join a lawsuit by Elon Musk against OpenAI, the agency wrote in a letter made public on Tuesday, saying that the office did not see how Musk's action serves the public interest of the state.Musk, a co-founder of the ChatGPT maker, is now",
                "content": "SAN FRANCISCO : The California attorney general's office declined to join a lawsuit by Elon Musk against OpenAI, the agency wrote in a letter made public on Tuesday, saying that the office did not see how Musk's action serves the public interest of t... [1921 chars]"
            },
            {
                "title": "This fund manager thinks ASX gold shares are top buys right now",
                "description": "According to one fund manager, ASX gold shares could be a great place to invest right now. Here’s why they could be a sparkly opportunity.",
                "content": "You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources , and mo... [2581 chars]"
            },
            {
                "title": "Bill Ackman’s Billionaire Bet On Much Loved British Watch Brand Has Been Years In The Making",
                "description": "According to Ackman, this is part investment, part passion, part mission.",
                "content": "Bill Ackman now owns 63% of Bremont through his newly created Bremont Long Term Trust.\nBremont launched its new Altitude collection at Watches & Wonders 2025 .\n. Ackman is positioning Bremont as Britain’s answer to Swiss watchmaking.\nIt’s not every d... [5485 chars]"
            },
            {
                "title": "Mongolian Mining Corporation Reports Q1 2025 Operational Update",
                "description": "Mongolian Mining ( ($HK:0975) ) has shared an announcement. Mongolian Mining Corporation reported a 3% year-on-year increase in run-of-mine coal output for the firs...",
                "content": "Mongolian Mining ( (HK:0975) ) has shared an announcement.\nMongolian Mining Corporation reported a 3% year-on-year increase in run-of-mine coal output for the first quarter of 2025, while sales of washed coking coal products decreased by 3% compared ... [821 chars]"
            },
            {
                "title": "Emerson duty-free shop owner urges feds to step up as plunging cross-border travel 'evaporates' sales",
                "description": "The owner of the Emerson Duty Free Shop says his family's business is at risk of shutting down if the federal government doesn't step up with financial relief, as plummeting cross-border travel has dried up sales at those stores across Canada.",
                "content": "The owner of the duty-free shop in Emerson, Man., says his family's business is at risk of shutting down if the federal government doesn't step up with financial relief, as plummeting cross-border travel has dried up sales at those stores across Cana... [3290 chars]"
            },
            {
                "title": "Disposable vape use falling in UK ahead of government ban",
                "description": "The number of people vaping in the UK has stalled, while disposable vape usage has fallen, a study suggests.",
                "content": "Disposable vape use falling in UK ahead of ban\n43 minutes ago Share Save Annabel Rackham Health reporter Share Save\nGetty Images Disposable vapes will no longer be available for sale after 1 June 2025 due to a government ban in the UK\nThe popularity ... [2300 chars]"
            },
            {
                "title": "Disposable vape use falling in UK ahead of government ban",
                "description": "The number of people vaping in the UK has stalled, while disposable vape usage has fallen, a study suggests.",
                "content": "The UK government ban on disposable and single-use vapes is aimed at stopping littering as, in most cases, the vapes cannot be recycled and often end up in landfill or pollute natural environments.\nThe ban is also aimed at tackling rising rates of yo... [1389 chars]"
            },
            {
                "title": "Tariffs fallout: The US will struggle to take on Asia over chips",
                "description": "America is trying to create a chip industry through isolation and protectionism, when what allowed it to emerge in Asia is the opposite: collaboration",
                "content": "Listen to this article\nThe US has \"dropped the ball\" on chip manufacturing over the years, allowing China and other Asian hubs to steam ahead. So said Gina Raimondo, who at the time was the US Commerce Secretary, in an interview with me back in 2021.... [684 chars]"
            },
            {
                "title": "The US will struggle to take on Asia over chips",
                "description": "America is trying to create a chip industry through isolation and protectionism, when what allowed it to emerge in Asia is the opposite: collaboration",
                "content": "The perils of Trump's chips strategy: the US will struggle to take on Asia\n41 minutes ago Share Save Suranjana Tewari Reporting from Singapore Share Save\nBBC\nListen to this article The US has \"dropped the ball\" on chip manufacturing over the years, a... [8972 chars]"
            },
            {
                "title": "Zuckerberg feared monopoly scrutiny and mulled Instagram split, files show",
                "description": "Testimony that Instagram was ‘better’ seems to bolster allegations Meta used ‘buy or bury’ tactic to snap up rivals",
                "content": "Meta’s chief executive Mark Zuckerberg considered spinning off Instagram in 2018 in anticipation of a potential antitrust suit, documents unveiled at a trial in Washington showed on Tuesday.\n​​“While most companies resist break-ups, the corporate his... [3388 chars]"
            }
        ]
    },
    {
        "14": [
            {
                "title": "Home prices in Canada expected to dip in 2025: forecast",
                "description": "According to a new forecast by TD Bank, home prices and the volume of transactions will see a dip in Canada in 2025.",
                "content": "Following an uptick in home prices in 2024, British Columbia could see a potential decline in housing prices in 2025.\nAccording to a recent forecast by TD Bank’s economists, average home prices in B.C. will fall by 4.1 per cent in 2025, before rising... [3005 chars]"
            },
            {
                "title": "Meta chief Zuckerberg testifies at landmark US antitrust trial",
                "description": "WASHINGTON: Meta chief and co-founder Mark Zuckerberg took the stand on Monday (Apr 14) in a landmark US antitrust trial in which his social media juggernaut stands accused of abusing its market",
                "content": "WASHINGTON: Meta chief and co-founder Mark Zuckerberg took the stand on Monday (Apr 14) in a landmark US antitrust trial in which his social media juggernaut stands accused of abusing its market power to acquire Instagram and WhatsApp before they cou... [1365 chars]"
            },
            {
                "title": "Solving the Trilemma: how to advance Asia’s Energy Transition",
                "description": "Asia’s rapid growth makes reducing regional emissions even more challenging. Good regulation, proper subsidies and supply chains for new technologies are required.",
                "content": "This article was previously published in our newsletter, if you're not already a subscriber, sign up here.\nIt feels like the world’s journey to net zero emissions is at a crossroads. Gone is the enthusiasm among policymakers, companies and investors ... [6122 chars]"
            },
            {
                "title": "Jamie Dimon sells $31.5M worth of JPMorgan shares in latest round of stock sales",
                "description": "JPMorgan Chase CEO Jamie Dimon has sold about $31.5 million worth of the bank's shares, according to a regulatory filing.",
                "content": "JPMorgan Chase CEO Jamie Dimon has sold about $31.5 million worth of the bank’s shares, according to a regulatory filing.\nDimon had also offloaded some shares last year in his first such sale since taking over the top role in 2005.\nJPMorgan, the larg... [885 chars]"
            },
            {
                "title": "Xpeng to start using in-house developed autonomous driving chip in its EVs in Q2, report says",
                "description": "Xpeng's Turing chip will be officially mass-produced in the second quarter, and will first be used in one of its new models, according to local media.",
                "content": "Xpeng's in-house developed autonomous driving chip will will first be used in one of its new models, according to local media.\nThe chip is 20 percent more utilized than general-purpose automotive chips and can handle large models with up to 30 billio... [4243 chars]"
            },
            {
                "title": "Starbucks' 2025 dress code requires baristas to wear certain colors",
                "description": "Starbucks is updating its dress code, limiting the amount of colors staff can wear with its green aprons starting on May 12.",
                "content": "Starbucks is updating its dress code to limit the amount of colors that staff can wear as part of effort to enhance its signature green apron look.\nStarting on May 12, baristas will be required to wear a solid black top, whether it's a crewneck, coll... [2097 chars]"
            },
            {
                "title": "Proposed Republican tax change would lead to spike in costs for Canadians who invest in U.S. securities",
                "description": "Investors who hold foreign securities – including from the U.S. – may have to pay a non-resident withholding tax on income",
                "content": "Open this photo in gallery: The U.S. Capitol, in Washington, on April 8.TIERNEY L. CROSS/The New York Times News Service\nCanadian investors holding U.S.-listed securities could see a sudden spike in the amount of tax they owe under a recent U.S. bill... [5775 chars]"
            },
            {
                "title": "Manitoba 'repatriating' some hydro exports from U.S., premier says",
                "description": "Premier Wab Kinew said Monday he has ordered Manitoba Hydro not to renew some expiring hydroelectricity export contracts to the U.S. The provincial Crown corporation, however, said it had no plans to renew the contracts.",
                "content": "Premier Wab Kinew said he has ordered Manitoba Hydro not to renew 500 megawatts worth of expiring hydroelectricity export contracts to the United States.\nThe provincial Crown corporation, however, said it had no plans to renew the contracts, which ar... [4109 chars]"
            },
            {
                "title": "Could Canada be caught between China, U.S. trade war?",
                "description": "Canada’s semiconductor industry could soon be caught in the economic vice grip of the escalating trade war between the United States and China.",
                "content": "The IBM logo is seen at their company facility in Bromont, Que., on Friday, April 26, 2024. THE CANADIAN PRESS/Christinne Muschi\nCanada’s semiconductor industry could soon be caught in the economic vice grip of the escalating trade war between the Un... [4590 chars]"
            },
            {
                "title": "Could Canada be caught between China, U.S. trade war?",
                "description": "Canada’s semiconductor industry could soon be caught in the economic vice grip of the escalating trade war between the United States and China.",
                "content": "The IBM logo is seen at their company facility in Bromont, Que., on Friday, April 26, 2024. THE CANADIAN PRESS/Christinne Muschi\nCanada’s semiconductor industry could soon be caught in the economic vice grip of the escalating trade war between the Un... [4590 chars]"
            }
        ]
    }
]