[
    {
        "16": [
            {
                "title": "'My Head Is Still Screaming for You'",
                "description": "Half a year after the death of Liam Payne, his sister Ruth Gibbins remembered her brother in an emotional tribute.",
                "content": "Half a year after the death of Liam Payne, his sister Ruth Gibbins remembered her brother in a heartfelt tribute.\n“My head is still screaming for you,” Gibbins wrote in an Instagram post shared on Wednesday. “Each morning on waking, I feel like I am ... [2654 chars]"
            },
            {
                "title": "How Bob Geldof's daughters have all found love with creative men who enjoy low-key lifestyles - after growing up in the limelight and coping with a series of tragic family deaths",
                "description": "Bob Geldof famously sang 'to live in love is all there is; life without love is meaningless'. And it seems his daughters have heeded his message.",
                "content": "Bob Geldof famously sang 'to live in love is all there is; life without love is meaningless'.\nAnd it seems his daughters have heeded his message, going on to settle down and start families with men that have obtained their famous father's approval.\nG... [8540 chars]"
            },
            {
                "title": "Michelle Trachtenberg: Gossip Girl star died from complications relating to Diabetes",
                "description": "American actress Michelle Trachtenberg’s cause of death has been revealed two months after she was found unresponsive in NYC.",
                "content": "American actress Michelle Trachtenberg’s death was the result of complications relating to her Diabetes condition, a medical examiner has determined.\nThe Gossip Girl and Buffy the Vampire Slayer star, 39, was found unresponsive by her mother in her N... [1634 chars]"
            },
            {
                "title": "Fyre Festival 2 Postponed, No New Date Announced",
                "description": "Fyre Festival 2 has reportedly been postponed by organizers, and tickets have been refunded, with no new date for the music festival announced.",
                "content": "Fyre Festival 2 isn’t going as planned (for the second time).\nThe second coming of the ill-fated music festival has reportedly been postponed by organizers. “The event has been postponed and a new date will be announced. We have issued you a refund. ... [1573 chars]"
            },
            {
                "title": "'Gossip Girl' star Michelle Trachtenberg's cause of death revealed; medical examiner cites complications from diabetes",
                "description": "Michelle Trachtenberg, known for her roles in 'Gossip Girl' and 'Buffy the Vampire Slayer', died at 39 due to complications from diabetes, as revealed by New York City's medical examiner. Her death, initially labeled as 'undetermined', has prompted condolences from her co-stars and fans.",
                "content": "Michelle Trachtenberg’s SECRET BATTLE EXPOSED: NYC Medical Examiner Discloses Cause Of Death\nActor Michelle Trachtenberg died as a result of complications from diabetes, New York City's medical examiner said Wednesday.The office said in a statement t... [1630 chars]"
            },
            {
                "title": "Actress Michelle Trachtenberg died of complications from diabetes, says NYC medical examiner",
                "description": "The medical examiner's office had initially listed Trachtenberg's death as “undetermined” but amended the cause and manner of death following a review of laboratory test results.",
                "content": "Actor Michelle Trachtenberg died as a result of complications from diabetes, New York City's medical examiner said Wednesday (Apr 16).\nThe office said in a statement that it amended the cause and manner of death for the 39-year-old New York City nati... [1526 chars]"
            },
            {
                "title": "Oh My God! Friends' Crew Had To Hide Janice Before Her Entrances On Set, And The Actress Explained Why",
                "description": "The Friends crew had to hide Maggie Wheeler's Janice before her entrances on set because fans and crowds loved her on the show so much.",
                "content": "If you’ve ever watched Friends, there’s no forgetting Chandler Bing’s on-again, off-again girlfriend, Janice Hosenstein, played by Maggie Wheeler. Even among the sea of stellar guest appearances , Wheeler quickly became a recognizable face in the wor... [3485 chars]"
            },
            {
                "title": "Update On Omos' WWE Status",
                "description": "Did WWE bench Omos after a successful stint in Pro Wrestling NOAH earlier this year?",
                "content": "Did WWE bench Omos after a successful stint in Pro Wrestling NOAH?\nBack in January, Omos had a very promising month as a member of the Pro Wrestling NOAH roster. He even captured the GHC Tag Team Titles with Jack Morris.\nHowever, after a successful t... [1141 chars]"
            },
            {
                "title": "Michelle Trachtenberg's cause of death revealed by coroner",
                "description": "Michelle Trachtenberg's cause of death comes to light more than a month after the 'Harriet the Spy' actor was found unresponsive in her New York City apartment.",
                "content": "New York City Office of the Chief Medical Examiner has determined the cause of death for actor Michelle Trachtenberg, who died in late February. She was 39.\nMichelle Trachtenberg’s cause of death has come to light more than a month after the “Ice Pri... [2580 chars]"
            },
            {
                "title": "On the taste trail: Heading south along the Rail Corridor for prawn noodles with an 82-year history",
                "description": "Mediacorp GOLD 905’s Denise Tan follows the former railway line from Buona Vista to Bukit Merah Lane 1 for a satisfying bowl of The Old Stall Hokkien Street’s famous pork rib and prawn mee.",
                "content": "The Alexandra Village Food Centre might be temporarily closed for renovations, but before it did, we were lucky enough to check out one particular traditional prawn noodle stall after a trek down the southern stretch of the Rail Corridor towards Tanj... [452 chars]"
            }
        ]
    },
    {
        "15": [
            {
                "title": "Actor says she’s serious about ‘giving up’",
                "description": "The Australian star is currently playing a fading actor on stage in London. The role seems to have hit a nerve.",
                "content": "Award-winning Australian actor Cate Blanchett has said she is “serious about giving up acting”, and wants to step away from the limelight to focus on other things in her life.\nIn an interview with British magazine Radio Times, the Melbourne-born star... [665 chars]"
            },
            {
                "title": "Actor says she’s serious about ‘giving up’",
                "description": "The Australian star is currently playing a fading actress on stage in London. The role seems to have hit a nerve.",
                "content": "Award-winning Australian actress Cate Blanchett has said she is “serious about giving up acting”, and wants to step away from the limelight to focus on other things in her life.\nIn an interview with British magazine Radio Times, the Melbourne-born st... [671 chars]"
            },
            {
                "title": "Wink Martindale, the genial game-show host and an early TV interviewer of Elvis Presley, dies at 91",
                "description": "Wink Martindale, the genial host of such hit game shows as “Gambit” and “Tic-Tac-Dough,” has died",
                "content": "Wink Martindale, the genial host of such hit game shows as “Gambit” and “Tic-Tac-Dough,” has died\nWink Martindale, the genial game-show host and an early TV interviewer of Elvis Presley, dies at 91\nFILE - Host Wink Martindale indicates a correct answ... [6637 chars]"
            },
            {
                "title": "James Brolin reflects on 30 years of marriage with Barbra Streisand",
                "description": "James Brolin just dropped the most unexpected marriage advice on live TV—and honestly, it might be the comfiest tip ever. During his April 15 appearance on the Today show, the 84-year-old...",
                "content": "James Brolin on marriage with Barbra Streisand\nJames Brolin just dropped the most unexpected marriage advice on live TV—and honestly, it might be the comfiest tip ever. During his April 15 appearance on the Today show, the 84-year-old actor opened up... [1492 chars]"
            },
            {
                "title": "Johnny Depp looks unrecognisable with bushy grey beard and new striking eyes for Hollywood return",
                "description": "Johnny Depp has undergone a dramatic transformation for his upcoming project Day Drinker, which will see him star alongside the likes of Penelope Cruz and Madelyn Cline",
                "content": "Johnny Depp looks unrecognisable with bushy grey beard and new striking eyes for Hollywood return\nJohnny Depp has undergone a dramatic transformation for his upcoming project Day Drinker, which will see him star alongside the likes of Penelope Cruz a... [3649 chars]"
            },
            {
                "title": "Highlight to release new music as Beast for first time in 9 years",
                "description": "Boy band Beast is back for the first time in nine years with its original name.",
                "content": "Boy band Beast is back for the first time in nine years with its original name.The band's members debuted in 2009 under the name Beast but could not maintain the name after parting ways with former agency Cube Entertainment in 2017.Instead, members f... [849 chars]"
            },
            {
                "title": "Na Young Seok hailed for stopping drunk passenger mid-flight",
                "description": "Producer Na Young Seok has been lauded for stepping in to stop a drunk passenger’s disruptive behavior during a flight from Jeju to Gimpo on Ma…",
                "content": "Producer Na Young Seok has been lauded for stepping in to stop a drunk passenger’s disruptive behavior during a flight from Jeju to Gimpo on March 31st KST.\nAccording to a report on April 16th KST, Na’s good deed took place aboard a Korean Air flight... [1224 chars]"
            },
            {
                "title": "Records show Gene Hackman's wife researched symptoms of illness days before her death",
                "description": "A review of Betsy Arakawa's computer showed she was actively researching medical conditions related to COVID-19 and flu-like symptoms between Feb 8 and the morning of Feb 12.",
                "content": "Authorities in New Mexico on Tuesday (Apr 15) released a lengthy investigation report detailing some of the last emails, phone calls and internet searches by Gene Hackman’s wife in the days before her death, indicating that she was scouring for infor... [4014 chars]"
            },
            {
                "title": "Sagittarius Horoscope Predictions for Tomorrow, April 17, 2025: Find strength in stability",
                "description": "Sagittarius Horoscope Tomorrow for April 17, 2025, to know your astrological predictions. Avoid office gossip and distractions. | Horoscope",
                "content": "Tomorrow's planetary alignments invite Sagittarius-born to slow down and draw comfort in stability. Your adventurous spirit usually occupies your mind, but now the stars want you to cherish the value of being steady. The inner and outer balance needs... [2527 chars]"
            },
            {
                "title": "Jay McGuiness 'breaks down in tears and flees filming' on new BBC show after struggling to discuss the loss of his bandmate and pal Tom Parker",
                "description": "Jay McGuinness reportedly broke down in tears and had to stop filming during the new BBC series Pilgrimage, after becoming emotional over the loss of his bandmate Tom Parker.",
                "content": "Jay McGuiness reportedly broke down in tears and had to stop filming during the new BBC series Pilgrimage, after becoming emotional over the loss of his bandmate Tom Parker, who died in 2022 at the age of 33 following a battle with brain cancer.\nIn t... [3833 chars]"
            }
        ]
    },
    {
        "14": [
            {
                "title": "Yoo Hee Yeol returns to broadcasting after three-year hiatus following plagiarism controversy",
                "description": "Singer-songwriter Yoo Hee Yeol is set to make his return to broadcasting after a three-year break stemming from a plagiarism controversy.On April 1…",
                "content": "Singer-songwriter Yoo Hee Yeol is set to make his return to broadcasting after a three-year break stemming from a plagiarism controversy.\nOn April 14th KST, MBC FM4U’s 'Bae Chul Soo’s Music Camp' announced via official social media that Yoo Hee Yeol ... [1513 chars]"
            },
            {
                "title": "Complete Spoiler Listing, Additional Backstage News For WrestleMania 41 Go-Home Episode Of WWE Raw (4/14/2025)",
                "description": "The complete spoiler listing has surfaced ahead of tonight's episode of WWE Raw from the Golden 1 Center in Sacramento, California. Featured below is the",
                "content": "The complete spoiler listing has surfaced ahead of tonight’s episode of WWE Raw from the Golden 1 Center in Sacramento, California.\nFeatured below is the complete spoiler listing for the Monday, April 15, 2025, WrestleMania 41 “go-home” edition of WW... [989 chars]"
            },
            {
                "title": "‘Cobra Kai’ Star Quits Acting After 20 Years Of Acting",
                "description": "One of the stars of Netflix’s hit series \"Cobra Kai\" has “hung up the gloves” after 20 years of acting.",
                "content": "Courtney Henggeler and Ralph Macchio in \"Cobra Kai.\" NETFLIX\nOne of the stars of Netflix’s hit series Cobra Kai has “hung up the gloves” after 20 years of acting.\nCobra Kai, which ran for two seasons on the now-defunct YouTube Red channel in 2018 and... [3417 chars]"
            },
            {
                "title": "Savannah Chrisley and Robert Shiver Split",
                "description": "Savannah Chrisley is back on the market ... because she's no longer in a relationship with Robert Shiver.",
                "content": "Savannah Chrisley is back on the market ... because she's no longer in a relationship with Robert Shiver.\nThe reality TV star and the former college football player have called it quits after nearly 2 years of dating ... TMZ has confirmed.\nSavannah a... [646 chars]"
            },
            {
                "title": "Star Wars Zero Company Is The Next Big Star Wars Game",
                "description": "Star Wars Zero Company Is The Next Big Star Wars Game",
                "content": "It was teased a few weeks ago, but it’s now been officially revealed that the next big Star Wars game to release will be Star Wars: Zero Company.\nThe game is in development by Bit Reactor and Respawn Entertainment (Star Wars Jedi series) and Lucasflm... [532 chars]"
            },
            {
                "title": "Thing In Itself: Kendall Jenner and Hailey Bieber wear this Singaporean jewellery designer’s pieces",
                "description": "With fluid, sculptural forms and unexpected silhouettes, Thing In Itself crafts statement-making jewellery that has captured the eye of Hollywood’s most influential stylists.",
                "content": "“The designs aren’t conventional, so a lot of foundries didn’t have faith in producing them,” added Wong. Casting houses were wary of Thing In Itself’s complex, organic silhouettes, fearing they would be technically challenging to execute.\nIt took pe... [1302 chars]"
            },
            {
                "title": "WWE RAW Spoiler Lineup for April 14, 2025: Full Match Card and Backstage Notes Revealed",
                "description": "WWE RAW is set to deliver an exciting night of action on April 14, 2025, with a lineup featuring thrilling matches and intense rivalries. Fans can look",
                "content": "WWE RAW is set to deliver an exciting night of action on April 14, 2025, with a lineup featuring thrilling matches and intense rivalries. Fans can look forward to surprises and moments that could shake things up as the show unfolds.\nThe spoiler lineu... [1212 chars]"
            },
            {
                "title": "Lady Gaga, Charli XCX, Post Malone",
                "description": "Who won weekend one of Coachella 2025? History-making headliners like Lady Gaga, Post Malone and Charli XCX and newcomers like Lola Young and Kneecap.",
                "content": "With the first weekend of Coachella 2025 now in the history books, clear winners have emerged among the dozens of acts who performed, including history-making headliners and small-font breakthroughs.\nBest Overall Set: Lady Gaga\nLady Gaga’s headlining... [5699 chars]"
            },
            {
                "title": "Ellen Pompeo Won't Leave 'Grey's Anatomy' as That Makes 'No Sense'",
                "description": "Ellen Pompeo won't leave \"Grey's Anatomy\" because it makes \"no sense, emotionally or financially.\"",
                "content": "Ellen Pompeo has starred in “Grey’s Anatomy” since its debut in 2005, and it sounds like she doesn’t plan to leave the show anytime soon.\nAlthough Pompeo’s character, Meredith Grey, has had less screen time since 2022, she recently shared why she has... [1427 chars]"
            },
            {
                "title": "Johnny Depp’s big movie return - in Snow White director’s thriller",
                "description": "The actor accused of domestic abuse makes his Hollywood comeback as greying yacht guest in Marc Webb’s Day Drinker",
                "content": "Johnny Depp is making a Hollywood comeback after being accused of domestic violence in several legal battles with his ex-wife, Amber Heard.\nProduction began this week on Day Drinker, which stars Depp, 61, alongside Penélope Cruz and Madelyn Cline. It... [799 chars]"
            }
        ]
    }
]