[
    {
        "16": [
            {
                "title": "444-year-old fossil belonging to the spider family with gut and brains intact has been found",
                "description": "A 444 million-year-old arthropod fossil, discovered 25 years ago, has been identified. The fossil, named Keurbos susanae, was found in South Africa's",
                "content": "Image credits: Getty Images\nWhen & where did the arthropod become a fossil?\nFossil was preserved inside-out\nImage credits: X/@SarahGabbott\nHow has the fossil been intact for so long?\nWhich family of arthropods does the fossil belong to?\nIn a shocking... [2581 chars]"
            },
            {
                "title": "Ghostly Rings of Dying Star Captured in Never-Before-Seen Detail by JWST",
                "description": "NGC 1514 is a planetary nebula about 1500 light-years away.",
                "content": "NGC 1514 is a planetary nebula about 1500 light-years away. William Herschel discovered it in 1790, and its discovery made him rethink the nature of nebulae.\nIt's been imaged many times by modern telescopes, and each time a more capable one revisits ... [6145 chars]"
            },
            {
                "title": "The Lyrid meteor shower is expected to dazzle the night sky beginning this week",
                "description": "The Lyrid meteor shower will reach a peak later this month, but stargazers can catch a first glimpse beginning Wednesday night.",
                "content": "The Lyrid meteor shower, one of the oldest annual meteor showers known to humankind, will once again grace Earth's sky beginning this week.\nThis year, the meteors are expected to come into view on Wednesday night and last through April 25.\nWhat exact... [1808 chars]"
            },
            {
                "title": "The Lyrid meteor shower is expected to dazzle the night sky beginning this week",
                "description": "The Lyrid meteor shower will reach a peak later this month, but stargazers can catch a first glimpse beginning Wednesday night.",
                "content": "The Lyrid meteor shower is expected to dazzle the night sky beginning this week\ntoggle caption Thomas Kronsteiner/Getty Images Europe\nThe Lyrid meteor shower, one of the oldest annual meteor showers known to humankind, will once again grace Earth's s... [1974 chars]"
            },
            {
                "title": "Hubble Space Telescope Revisits Messier 104",
                "description": "In anticipation of the upcoming 35th anniversary of the NASA/ESA Hubble Space Telescope, the Hubble team has released a beautiful new image of the Sombrero galaxy, also known as Messier 104.",
                "content": "In anticipation of the upcoming 35th anniversary of the NASA/ESA Hubble Space Telescope, the Hubble team has released a beautiful new image of the Sombrero galaxy, also known as Messier 104.\nMessier 104 is located approximately 28 million light-years... [2261 chars]"
            },
            {
                "title": "The Lyrid meteor shower is expected to dazzle the night sky beginning this week",
                "description": "The Lyrid meteor shower will reach a peak later this month, but stargazers can catch a first glimpse beginning Wednesday night.",
                "content": "The Lyrid meteor shower, one of the oldest annual meteor showers known to humankind, will once again grace Earth's sky beginning this week.\nThis year, the meteors are expected to come into view on Wednesday night and last through April 25.\nWhat exact... [1827 chars]"
            },
            {
                "title": "Scientists hail ‘strongest evidence’ so far for life beyond our solar system",
                "description": "Astrophysics team say observation of chemical compounds may be ‘tipping point’ in search for extraterrestrial life",
                "content": "A giant planet 124 light years from Earth has yielded the strongest evidence yet that extraterrestrial life may be thriving beyond our solar system, astronomers claim.\nObservations by the James Webb space telescope of a planet called K2-18 b appear t... [5278 chars]"
            },
            {
                "title": "Is this a hint of life on another world, or just a lot of hot air?",
                "description": "The James Webb Space Telescope may have detected life-associated gas in the atmosphere of a far-off planet. The news is being greeted with both enthusiasm and skepticism.",
                "content": "Is this a hint of life on another world, or just a lot of hot air?\ntoggle caption A. Smith, N. Madhusudhan/University of Cambridge\nAn ocean world that's teeming with microbes — and who knows what other kinds of life — is currently the best explanatio... [8441 chars]"
            },
            {
                "title": "Astronomers claim strongest evidence yet of extraterrestrial life",
                "description": "Distant planet is covered with an ocean that may be teeming with microbial activity",
                "content": "Astronomers have found signs of biological activity on a planet 124 light years from Earth, in what they call the strongest evidence yet of extraterrestrial life.\nScientists used a space telescope to detect specific organic molecules in the atmospher... [4382 chars]"
            },
            {
                "title": "Astronomers Detect a Signature of Life on a Distant Planet",
                "description": "Further studies are needed to determine whether K2-18b, which orbits a star 120 light-years away, is inhabited, or even habitable.",
                "content": "The search for life beyond Earth has led scientists to explore many suggestive mysteries, from plumes of methane on Mars to clouds of phosphine gas on Venus. But as far as we can tell, Earth’s inhabitants remain alone in the cosmos.\nNow a team of res... [860 chars]"
            }
        ]
    },
    {
        "15": [
            {
                "title": "When The Pandemic Came, Zoos Closed, And The Animals Started to Act Differently",
                "description": "We all had to make adjustments as the COVID-19 pandemic unfolded – even zoo animals who were suddenly not seeing crowds of visitors pass by every single day.",
                "content": "We all had to make adjustments as the COVID-19 pandemic unfolded – even zoo animals who were suddenly not seeing crowds of visitors pass by every single day.\nIn a study published in 2022, researchers discovered how primates reacted to that shift, loo... [3633 chars]"
            },
            {
                "title": "NASA recreates 80,000 years of moon exposure to confirm sun can create water",
                "description": "Using dust from Apollo 17, Scientists recreated the moon’s conditions and discovered that sunlight alone can generate water molecules.",
                "content": "Yahoo is using AI to generate takeaways from this article. This means the info may not always match what's in the article. Reporting mistakes helps us improve the experience.\nYahoo is using AI to generate takeaways from this article. This means the i... [4339 chars]"
            },
            {
                "title": "Quantum walks: What they are and how they can change the world",
                "description": "Quantum walk uses quantum physics for faster computing and problem-solving beyond classical limits.",
                "content": "Quantum walks are changing the way scientists think about computation. They use the strange and powerful rules of quantum physics—such as superposition, interference, and entanglement—to solve problems faster and more efficiently than classical compu... [7659 chars]"
            },
            {
                "title": "The First Ever Sighting of a Colossal Squid",
                "description": "An expedition spotted a baby of the species in the South Sandwich Islands. This cephalopod can grow to more than 20 feet and has proved elusive in its deep-sea environs.",
                "content": "In March, Kat Bolstad returned from an Antarctic expedition where she had used a new camera system specially built to search for the elusive colossal squid.\nNo one had captured footage of one of these animals swimming in the deep sea. She didn’t spot... [529 chars]"
            },
            {
                "title": "Scientists find evidence that overturns theories of the origin of water on Earth",
                "description": "University of Oxford researchers have helped overturn the popular theory that water on Earth originated from asteroids bombarding its surface. Instead, the material which built our planet was far richer in hydrogen than previously thought. The findings have been published today in the journal Icarus.",
                "content": "A team of researchers at the University of Oxford have uncovered crucial evidence for the origin of water on Earth. Using a rare type of meteorite, known as an enstatite chondrite, which has a composition analogous to that of the early Earth (4.55 bi... [3703 chars]"
            },
            {
                "title": "Runaway Magnetar is Traversing Milky Way from Unknown Place of Origin, Astronomers Say",
                "description": "SGR 0501+4516 is the likeliest candidate in our Milky Way Galaxy for a magnetar that was not born in a supernova explosion as initially predicted; the object is so strange it might even offer clues to the mechanism behind fast radio bursts.",
                "content": "SGR 0501+4516 is the likeliest candidate in our Milky Way Galaxy for a magnetar that was not born in a supernova explosion as initially predicted; the object is so strange it might even offer clues to the mechanism behind fast radio bursts.\n“Magnetar... [4372 chars]"
            },
            {
                "title": "Northern lights could be visible in parts of the US this week: Find out where and when",
                "description": "The dazzling display may be seen two nights in a row.",
                "content": "The dazzling display may be seen two nights in a row.\nNorthern lights could be visible in parts of the US this week: Find out where and when\nThe night sky in Wisconsin glows with the Northern Lights.\nThe night sky in Wisconsin glows with the Northern... [4293 chars]"
            },
            {
                "title": "Making desalination more eco-friendly: New membranes could help eliminate brine waste",
                "description": "Desalination plants, a major and growing source of freshwater in dry regions, could produce less harmful waste using electricity and new membranes.",
                "content": "Desalination plants, a major and growing source of freshwater in dry regions, could produce less harmful waste using electricity and new membranes made at the University of Michigan.\nThe membranes could help desalination plants minimize or eliminate ... [4527 chars]"
            },
            {
                "title": "Plants, Fungi And Bacteria Working Together",
                "description": "Since time immemorial, plants and arbuscular mycorrhizal fungi have coexisted in a mutually beneficial relationship. The fungi colonize plant roots",
                "content": "Since time immemorial, plants and arbuscular mycorrhizal fungi have coexisted in a mutually beneficial relationship. The fungi colonize plant roots and help them absorb nutrients. In return, plants provide the fungi with the carbon they need. \"These ... [4841 chars]"
            },
            {
                "title": "A solar storm could hit Earth. Here’s how it could affect you",
                "description": "Forecasters say the northern lights could be seen across a large swath of the U.S.",
                "content": "A solar storm could hit Earth. Here’s how it could affect you\nA solar storm could hit Earth. Here’s how it could affect you\nA powerful geomagnetic storm aimed at Earth could disrupt technology and bring a stunning celestial show as far south as Kentu... [2391 chars]"
            }
        ]
    },
    {
        "14": [
            {
                "title": "High school student's AI model spots 1.5 million unknown objects in NASA dataset",
                "description": "Matteo Paz, a Pasadena High School senior whose interest in astronomy was sparked by Caltech public lectures, used AI to develop a computational model while participating in Caltech's Summer Research Connection outreach program.",
                "content": "Matteo Paz, a Pasadena High School senior whose interest in astronomy was sparked by Caltech public lectures, used AI to develop a computational model while participating in Caltech’s Summer Research Connection outreach program. Under the mentorship ... [3332 chars]"
            },
            {
                "title": "Astronomer: More Starlink junk likely to be found in Sask.",
                "description": "On the prairies, things fall from the sky on a seemingly daily basis, whether it be rain, snow, or hail.A Sask...",
                "content": "Kennedy said a short time later, he reached out to Samantha Lawler, an associate professor of astronomy with the University of Regina.\n“A friend of mine in Saskatoon who is sort of a space guru himself… he had heard the interview with Samantha and th... [1899 chars]"
            },
            {
                "title": "Astronomer: More Starlink junk likely to be found in Sask.",
                "description": "On the prairies, things fall from the sky on a seemingly daily basis, whether it be rain, snow, or hail.A Sask...",
                "content": "Kennedy said a short time later, he reached out to Samantha Lawler, an associate professor of astronomy with the University of Regina.\n“A friend of mine in Saskatoon who is sort of a space guru himself… he had heard the interview with Samantha and th... [1899 chars]"
            },
            {
                "title": "Astronomer: More Starlink junk likely to be found in Sask.",
                "description": "On the prairies, things fall from the sky on a seemingly daily basis, whether it be rain, snow, or hail.A Sask...",
                "content": "Kennedy said a short time later, he reached out to Samantha Lawler, an associate professor of astronomy with the University of Regina.\n“A friend of mine in Saskatoon who is sort of a space guru himself… he had heard the interview with Samantha and th... [1899 chars]"
            },
            {
                "title": "Satellite Data Show Motion of Burma Earthquakes",
                "description": "NASA scientists employed a pixel-tracking method to reveal how much the ground shifted during one of the largest documented surface ruptures of its type.",
                "content": "At about 12:50 p.m. local time on March 28, 2025, a magnitude 7.7 earthquake started near the city of Mandalay, Burma (Myanmar). Twelve minutes later, the region shook again from a magnitude 6.7 quake with an epicenter about 31 kilometers (19 miles) ... [3421 chars]"
            },
            {
                "title": "NASA Set to Launch SpaceX 32nd Station Resupply Services Mission",
                "description": "NASA and SpaceX's mission will deliver over 6,400 pounds of science experiments, equipment, and supplies aboard a Dragon spacecraft.",
                "content": "The mission will deliver over 6,400 pounds of science experiments, equipment, and supplies.\nNASA and SpaceX are set to launch the 32nd commercial resupply services mission to the International Space Station at 4:15 a.m. EDT on Monday, April 21, 2025.... [4787 chars]"
            },
            {
                "title": "New Species of Sauropod Dinosaur Unearthed in Argentina",
                "description": "A new genus and species of rebbachisaurid sauropod dinosaur has been described from fossils discovered at a paleontological locality in the Argentine province of Neuquén.",
                "content": "A new genus and species of rebbachisaurid sauropod dinosaur has been described from fossils discovered at a paleontological locality in the Argentine province of Neuquén.\nThe newly-discovered dinosaur roamed Earth during the Late Cretaceous epoch, so... [2267 chars]"
            },
            {
                "title": "Starliner-1 and Artemis II",
                "description": "Joshua Kutryk and Jeremy Hansen are the next Canadians set to go to space via their respective missions, Starliner-1 and Artemis II.",
                "content": "In case you missed it, pop singer Katy Perry was one of six people launched into space on Monday, April 14, 2025, via Jeff Bezos’ Blue Origin. The all-female crew went to space for 11 minutes aboard the fully automated New Shepard rocket, “Blue Origi... [4259 chars]"
            },
            {
                "title": "Lyrids 2025: How to see the first meteor shower of spring peak next week",
                "description": "Up to 18 \"shooting stars\" per hour may be visible during the peak of the Lyrid meteor shower on April 21-22.",
                "content": "(Image credit: Alan Dyer/Stocktrek Images via Getty Images)\nThe first meteor shower of spring in the Northern Hemisphere, the Lyrids, will peak overnight on April 21-22. This year, the annual meteor shower will peak in virtually moonless night skies,... [2130 chars]"
            },
            {
                "title": "At Quanta: High Bird Intelligence Developed on a Different Path",
                "description": "It is ironic that otherwise intelligent people must play the “we’re just another animal” game while demanding attention for ideas that only humans can give.",
                "content": "Note: Pre-order The Immortal Mind by Michael Egnor and Denyse O’Leary and get a sneak peek exclusive excerpt from the book as well as the full digital book anthology Minding The Brain.\nAt Quanta, science writer Yasemin Saplakoglu explores the thesis ... [5290 chars]"
            }
        ]
    }
]