[
    {
        "16": [
            {
                "title": "Arsenal prove true Champions League contender status in dismantling of mighty Real Madrid",
                "description": "The Gunners are through to the UCL semifinals, but they are aiming higher after bouncing the UCL kings",
                "content": "They were right, 90 minutes is a long time in the Santiago Bernabeu. Still, even if VAR had elongated this to 390 minutes, it would not have been anywhere near long enough for Real Madrid to scramble their way back into a tie that was rent from them ... [4907 chars]"
            },
            {
                "title": "IPL 2025: Chahal proves value for money with wicket burst vs KKR",
                "description": "Yuzvendra Chahal shines with four wickets, leading Punjab Kings to victory over KKR, boosting team morale and hope for playoffs in IPL. | Crickit",
                "content": "Chandigarh: There is no escape from the value-for-money demand IPL makes on players. Yuzvendra Chahal would have felt that pressure after Punjab Kings (PBKS) made him the most expensive spinner bought at an auction, splurging ₹18 crore for the 34-yea... [2195 chars]"
            },
            {
                "title": "No comeback for Real Madrid as Arsenal is back in Champions League semifinals",
                "description": "Arsenal has defeated defending champion Real Madrid 2-1 to reach the Champions League semifinals for the first time since 2009 in a match where VAR played a key role in two penalty decisions.",
                "content": "MADRID (AP) — Arsenal defeated defending champion Real Madrid 2-1 on Wednesday to reach the Champions League semifinals for the first time since 2009 in a match where VAR played a key role in two penalty decisions.\nArsenal advanced 5-1 on aggregate a... [4294 chars]"
            },
            {
                "title": "'Seriously broken' - Paige Bueckers's new salary a reminder how little WNBA players earn",
                "description": "Basketball's newest star is projected to earn just $78,831 US for her rookie year — about $109,480 Cdn, or less than the real median household income in the States.",
                "content": "You might think a big paycheque would be a slam dunk.\nBasketball player Paige Bueckers, after helping UConn win its 12th national championship on Monday, became the WNBA's No. 1 draft pick by the Dallas Wings.\nThe three-time, first-team All-American ... [7897 chars]"
            },
            {
                "title": "Champions League semi-final dates confirmed",
                "description": "After we beat Real Madrid in the Champions League quarter-finals, we will play Paris Saint-Germain in the semi-finals",
                "content": "After we knocked out Real Madrid to reach the Champions League semi-finals for the third time in our history, we will take on Paris Saint-Germain across two legs for a spot in the final.\nWe can confirm that the first leg will take place at Emirates S... [1609 chars]"
            },
            {
                "title": "Toronto aims to turn over a new Leaf under Berube after clinching first Atlantic Division title",
                "description": "Toronto Maple Leafs are riding a 12-2-1 run over their past 15 games as playoffs loom",
                "content": "Open this photo in gallery: Toronto Maple Leafs center Auston Matthews celebrates his goal with goaltender Anthony Stolarz during the third period against the Buffalo Sabres on April 15, 2025, in Buffalo, N.Y.Jeffrey T. Barnes/The Canadian Press\nFor ... [3919 chars]"
            },
            {
                "title": "Agreement to bring Commanders’ stadium to RFK site in D.C. taking shape",
                "description": "A framework has emerged that indicates the Commanders would pay most of the cost of the mixed-use project on the 174-acre federal land site.",
                "content": "An agreement between the Washington Commanders and the D.C. government to return the NFL franchise to the nation’s capital and build a stadium project costing more than $3 billion is taking shape.\nNegotiations between the NFL franchise and the office... [3560 chars]"
            },
            {
                "title": "Outdoorsman Iafallo sticks with Jets",
                "description": "Breaking News, Sports, Manitoba, Canada",
                "content": "Alex Iafallo’s teammates often joke he’s “the most interesting man in the world.”\n“We joke around that he’s the Dos Equis guy… because in the summertime, he goes off the grid and goes camping or is out in his truck,” Dylan DeMelo said on Wednesday mo... [6654 chars]"
            },
            {
                "title": "Did Mitchell Starc bowl a no-ball in Super Over of DC vs RR match? Here's what the rule says",
                "description": "Mitchell Starc’s no-ball in the Super Over during DC vs RR IPL 2025 clash sparked confusion and debate even among commentators. Here’s what the MCC rule says about return crease violations.",
                "content": "Mitchell Starc’s no-ball in the Super Over during DC vs RR IPL 2025 clash sparked confusion and debate even among commentators. Here’s what the MCC rule says about return crease violations. read more\nThe Mitchell Starc delivery that was called a no-b... [2319 chars]"
            },
            {
                "title": "“Everyone wastes time when winning” — Bayern Munich’s Josip Stanisic talks pushing Inter Milan ball boy",
                "description": "That’s not very classy (I’ll let you decide who that was directed at)",
                "content": "Bayern Munich gave everything they had but lost out on aggregate to Inter Milan, bringing an end to theirs and Thomas Müller’s European journey. It got heated near the end of the match, where Josip Stanisic notably pushed a ball boy off his stool for... [1383 chars]"
            }
        ]
    },
    {
        "15": [
            {
                "title": "How much each NBL team spent in 2024-25",
                "description": "The Illawarra Hawks won an NBL title without exceeding the salary cap, in what was a fascinating season of spending from teams around the league. ESPN Basketball Insider Olgun Uluc breaks down all the numbers.",
                "content": "Open Extended Reactions\nThe Illawarra Hawks won an NBL title without exceeding the salary cap, in what was a fascinating season of spending from teams around the league.\nA 'soft cap' is in place for teams to exceed the salary cap and pay a luxury tax... [14270 chars]"
            },
            {
                "title": "Rory McIlroy sports psychologist opens up on Bryson DeChambeau silent treatment",
                "description": "Rory McIlroy's Masters win on Sunday was years in the making, but one of the stories that made plenty of headlines during the major was him giving the silent treatment to his playing partner, Bryson DeChambeau, during the final round.",
                "content": "Rory McIlroy’s Masters win on Sunday was years in the making, but one of the stories that made plenty of headlines during the major was him giving the silent treatment to his playing partner, Bryson DeChambeau, for the final round.\nNow there’s a defi... [1951 chars]"
            },
            {
                "title": "Marcus Rashford: Aston Villa boss Unai Emery praises 'fantastic' forward",
                "description": "Marcus Rashford produces arguably his best display as Aston Villa come close to completing a stunning comeback against Paris St-Germain.",
                "content": "He may not have scored himself, but Marcus Rashford arguably provided the spark that almost led Aston Villa to one of the great Champions League comebacks against Paris St-Germain.\nThe England forward had been fairly quiet in the first half as the Fr... [656 chars]"
            },
            {
                "title": "Marcus Rashford: Aston Villa boss Unai Emery praises 'fantastic' forward",
                "description": "Marcus Rashford produces arguably his best display as Aston Villa come close to completing a stunning comeback against Paris St-Germain.",
                "content": "He may not have scored himself, but Marcus Rashford arguably provided the spark that almost led Aston Villa to one of the great Champions League comebacks against Paris St-Germain.\nThe England forward had been fairly quiet in the first half as the Fr... [656 chars]"
            },
            {
                "title": "Tennis player Harriet Dart apologizes for saying opponent should put on deodorant during match",
                "description": "PARIS (AP) — British tennis player Harriet Dart has apologized after asking the chair umpire to tell her opponent to put on deodorant because she “smells really bad.”",
                "content": "Tennis player Harriet Dart apologizes for saying opponent should put on deodorant during match\nPARIS (AP) — British tennis player Harriet Dart has apologized after asking the chair umpire to tell her opponent to put on deodorant because she “smells r... [1217 chars]"
            },
            {
                "title": "Power play: How Port keeps halting the Hawks",
                "description": "Cal Twomey takes a closer look at how the Power have found a way to take away the Hawks' weapons",
                "content": "Cal Twomey takes a closer look at how the Power have found a way to take away the Hawks' weapons\nJames Sicily looks dejected after Hawthorn's loss to Port Adelaide in round five, 2025. Picture: AFL Photos\nHAWTHORN has only lost five games since last ... [3134 chars]"
            },
            {
                "title": "Nat Fyfe comeback cruelled by WAFL injury, Fremantle Dockers latest updates",
                "description": "‘Obviously frustrating’: Champion’s sad setback amid fears career could end with a whimper",
                "content": "The stunning career of dual Brownlow medallist Nat Fyfe is threatening to end with a whimper after scans confirmed he suffered a moderate-grade hamstring strain playing in the WAFL last weekend.\nWhile Fyfe, 32, won’t need surgery he could miss a prol... [3788 chars]"
            },
            {
                "title": "'Hard to believe': NHL players rank Jets' Hellebuyck a lowly No. 3",
                "description": "Connor Hellebuyck of the Winnipeg Jets is not the best or even the second-best NHL goalie, according to the players who face him every game.",
                "content": "Get the latest from Paul Friesen straight to your inbox\nGet the latest from Paul Friesen straight to your inbox Sign Up\nConnor Hellebuyck is not the best goalie in the NHL or even the second-best, according to the players who face him every game.\nThi... [1279 chars]"
            },
            {
                "title": "Transfer windows keep college football rosters in flux",
                "description": "College football coaches don’t know which players from the spring practices will be on the roster come August. A second NCAA transfer portal window opens Wednesday.",
                "content": "(Editor's note: This is the first installment of a multi-part series by MTN Sports on the current state of college athletics.)\nMISSOULA — Spring football workouts historically allowed players to earn their positions on the depth chart.\nCoaches could ... [5192 chars]"
            },
            {
                "title": "Preview: Real Madrid v Arsenal",
                "description": "As we aim to reach the Champions League semis, get team news, stats, the lowdown on Madrid and more in our guide to the game",
                "content": "After our excellent display last week against Real Madrid, we take a 3-0 lead to the iconic Estadio Santiago Bernabeu on Wednesday (8pm UK), leaving the prospect of a third-ever Champions League semi-final in our history tantalisingly close.\nDeclan R... [9414 chars]"
            }
        ]
    },
    {
        "14": [
            {
                "title": "Hailey Van Lith's WNBA orange carpet outfit sparks epic 1-word reaction from Angel Reese",
                "description": "Hailey Van Lith showed up at the WNBA orange carpet ahead of the WNBA Draft night.",
                "content": "Hailey Van Lith showed up at the WNBA orange carpet ahead of the WNBA Draft night. The TCU star arrived in a black bodycon shinning dress for the event, which caught the attention of her former LSU teammate Angel Reese.\nAd\nA user on X/Twitter posted ... [3086 chars]"
            },
            {
                "title": "Dallas Wings choose UConn star Paige Bueckers with 1st pick of 2025 WNBA draft",
                "description": "Paige Bueckers is headed to Dallas as the first pick Monday night in the WNBA draft. The versatile UConn star is the latest Huskies standout to go No. 1, joining former greats Sue Bird, Diana Taurasi, Maya Moore and Breanna Stewart.",
                "content": "Paige Bueckers is ready for her next chapter after a whirlwind week that started with her helping UConn win its 12th national championship and ended with her becoming the WNBA's No. 1 draft pick by the Dallas Wings.\n\"I'm just extremely excited to be ... [3540 chars]"
            },
            {
                "title": "Paige Bueckers Selected No.1 in 2025 WNBA Draft",
                "description": "UConn women's basketball alumna Paige Bueckers was selected with the No. 1 overall pick by the Dallas Wings in the 2025 WNBA Draft at The Shed at Hudson Yards in",
                "content": "NEW YORK – UConn women's basketball alumna Paige Bueckers was selected with the No. 1 overall pick by the Dallas Wings in the 2025 WNBA Draft at The Shed at Hudson Yards in New York City.\nBueckers is the sixth No. 1 pick in UConn history, joining Sue... [1616 chars]"
            },
            {
                "title": "Bulldogs prop Max King targets rugby league Ashes, for England or Australia",
                "description": "Bulldogs prop Max King wants to play in the Ashes. Who for? Even he doesn't know, with the front-rower open to representing either Australia or England.",
                "content": "Max King would love the chance to follow in his grandfather's footsteps and play in this year's Ashes series.\nBut who for?\nThe Canterbury prop is yet to decide, with his form and a player drain to the Pacific nations putting the Huddersfield-born for... [2284 chars]"
            },
            {
                "title": "WNBA draft 2025: Bueckers, Iriafen among top dressed stars",
                "description": "Paige Bueckers and Kiki Iriafen took the orange carpet by storm at the 2025 WNBA draft in New York City. Here are the best fits from the night.",
                "content": "The next wave of the WNBA is here -- making just as bold a statement off the court as on it.\nFresh off leading the UConn Huskies to their 18th national championship, Paige Bueckers is all but a lock to go No. 1 overall to the Dallas Wings.\nBut she's ... [2337 chars]"
            },
            {
                "title": "Juan Soto talks to Post about pitchers' approach without Aaron Judge protection",
                "description": "One thing is certain to Juan Soto: He’s not getting pitched the same as last season, when he had Aaron Judge hitting behind him in the Yankees lineup.",
                "content": "MINNEAPOLIS — Juan Soto is still waiting for pitchers to attack him.\nWith roughly 10 percent of the season complete, the All-Star outfielder had these numbers on his Mets stat line as play began Monday at Target Field: a .409 on-base percentage (well... [719 chars]"
            },
            {
                "title": "Wings select Paige Bueckers with 1st overall pick",
                "description": "Trending News & Rumors for Football, Basketball, Baseball, Hockey, Soccer & More",
                "content": "Follow the 2025 WNBA Draft with theScore's live tracker to view all 38 selections as they happen.\nThe Dallas Wings selected UConn star Paige Bueckers with the No. 1 overall pick in the 2025 WNBA Draft on Monday.\nBueckers fills the Wings' need for a d... [1250 chars]"
            },
            {
                "title": "Wings select Paige Bueckers with 1st overall pick",
                "description": "Trending News & Rumors for Football, Basketball, Baseball, Hockey, Soccer & More",
                "content": "Follow the 2025 WNBA Draft with theScore's live tracker to view all 38 selections as they happen.\nThe Dallas Wings selected UConn star Paige Bueckers with the No. 1 overall pick in the 2025 WNBA Draft on Monday.\nBueckers fills the Wings' need for a d... [1250 chars]"
            },
            {
                "title": "The who’s who of who’s next",
                "description": "Breaking News, Sports, Manitoba, Canada",
                "content": "The regular-season banners have been secured and are on order.\nWith one game left in the regular season on Wednesday against the Anaheim Ducks, the Winnipeg Jets have one more dress rehearsal before the curtain rises on the 2025 Stanley Cup playoffs.... [8106 chars]"
            },
            {
                "title": "Montreal Canadiens' Ivan Demidov comes out flying with goal, assist",
                "description": "Montreal Canadiens highly-touted prospect Ivan Demidov wasted no time making an impact in his first career NHL game.",
                "content": "Montreal Canadiens highly-touted prospect Ivan Demidov wasted no time making an impact in his first career NHL game.\nOn just his second shift of the game, the 19-year-old Russian right winger made a nice centering pass from behind the goal line to fo... [1683 chars]"
            }
        ]
    }
]