[
    {
        "16": [
            {
                "title": "All The Aussie Times For Tonight's Mario Kart World Direct And Where To Watch",
                "description": "All The Aussie Times For Tonight's Mario Kart World Direct And Where To Watch",
                "content": "There was a lot of info during the Nintendo Switch 2 Nintendo Direct last week, so I wouldn’t forgive you for missing (or forgetting) that a Mario Kart World Nintendo Direct is happening this week that will reveal loads more info about the game in a ... [921 chars]"
            },
            {
                "title": "Aries Horoscope Predictions for Tomorrow, April 18, 2025: Your calm is the catalyst for success",
                "description": "Aries Horoscope Tomorrow for April 18, 2025, to know your astrological predictions. Continue maintaining focus while avoiding unnecessary conflicts.  | Horoscope",
                "content": "The planetary placements suggest that you'll have to balance your inherent fiery nature during the day ahead through calmness. These energies of the Moon and Mars can instigate upsurged anger amidst normal days. Patience is your mighty power, which w... [2392 chars]"
            },
            {
                "title": "Dodge Ram 1500 Generations: Key Updates Across All Model Years",
                "description": "See all generations of the Dodge Ram 1500: discover information about every model year and check out what was changed",
                "content": "Having first arrived in the early 1980s, there really is no shortage of Dodge Ram 1500 generations and models - with everything from entry-level V6-powered models, through to powerful Hemi-motivated four-wheel-drive trucks and even spin-off V10 model... [7949 chars]"
            },
            {
                "title": "How to watch the Mario Kart World Direct on 17 April",
                "description": "A Mario Kart World Direct revealing more about Mario Kart World gameplay, characters, and stages will air on 17 April. Here's how to watch.",
                "content": "A Mario Kart World Direct is set to air on 17 April 2025, revealing brand new details about Mario Kart World and (as an aside) the Nintendo Switch 2. The show will be 15 minutes long, and will likely detail features new to the franchise, including ne... [2254 chars]"
            },
            {
                "title": "Microsoft Teams' newest feature will stop you from making embarrassing typos to your workmates",
                "description": "Get a second opinion on your spelling.",
                "content": "Summary Microsoft Teams has an enhanced spell checker with multi-language support, a useful tool for professional messaging.\nEnhanced spell check marks issues in messages, provides correction options in a dropdown menu, and allows users to switch bet... [2277 chars]"
            },
            {
                "title": "Morbidly obese dad who feared he was going to die after supermarket collapse sheds 22st and wins award",
                "description": "A MORBIDLY obese dad who feared he was going to die after collapsing in a supermarket has shed 22st and won a slimmers’ award.Kenny Higgins — down",
                "content": "A MORBIDLY obese dad who feared he was going to die after collapsing in a supermarket has shed 22st and won a slimmers’ award.\nKenny Higgins — down from 34st to 12st — was spending £140 a week on takeaways.\n2 A morbidly obese Kenny Higgins at his hea... [963 chars]"
            },
            {
                "title": "Samsung Electronics Ranked No.1 in Global Gaming Monitor Market for Six Consecutive Years",
                "description": "Company strengthens global leadership with 21.0% market share in gaming monitors, 34.6% in OLED monitors",
                "content": "Company strengthens global leadership with 21.0% market share in gaming monitors, 34.6% in OLED monitors\nSamsung Electronics today announced that it has retained its position as the world’s leading gaming monitor brand for the sixth consecutive year,... [3795 chars]"
            },
            {
                "title": "Shelly Palmer - Google's Veo is almost here",
                "description": "Veo is available to select creators through VideoFX, and Google says broader access is coming 'soon.'",
                "content": "Veo is available to select creators through VideoFX, and Google says broader access is coming 'soon.'\nGoogle is just about to drop Veo, a video generation model that can create high-quality 1080p footage from text, image and video prompts. Announced ... [2529 chars]"
            },
            {
                "title": "Android 16 Beta 4 arrives tomorrow",
                "description": "Google's next Android 16 preview will be here for you to test soon, as the company shares word that Beta 4 arrives tomorrow.",
                "content": "Rita El Khoury / Android Authority\nTL;DR Android 16 Beta 4 is scheduled to arrive tomorrow, April 17.\nThis is just over a month since Beta 3 landed, and 3.1 and 3.2 have arrived in the interim.\nGoogle’s getting down to the wire for making changes ahe... [1864 chars]"
            },
            {
                "title": "Novel machine learning model can predict material failure before it happens",
                "description": "A team of researchers has successfully predicted abnormal grain growth in simulated polycrystalline materials for the first time -- a development that could lead to the creation of stronger, more reliable materials for high-stress environments, such as combustion engines.",
                "content": "A team of Lehigh University researchers has successfully predicted abnormal grain growth in simulated polycrystalline materials for the first time -- a development that could lead to the creation of stronger, more reliable materials for high-stress e... [5422 chars]"
            }
        ]
    },
    {
        "15": [
            {
                "title": "EB Games Has 1TB Nintendo Switch 2 Compatible MicroSD Express Cards For A Decent Price",
                "description": "EB Games Has 1TB Nintendo Switch 2 Compatible MicroSD Express Cards For A Decent Price",
                "content": "I wasn’t expecting that EB Games would be the first supplier in Australia to have a range of MicroSD Express cards for Nintendo Switch 2 given they’re still in such short demand across the world but here we are.\nEB Games has this morning listed its h... [702 chars]"
            },
            {
                "title": "Round Up: The Previews Are In For Capcom Fighting Collection 2",
                "description": "Here's what the critics had to say - The Capcom Fighting Collection 2 arrives on Switch next month and we've now got our first batch of hands on. We've alre...",
                "content": "So, here's what other outlets had to say:\n\"Rest assured it’s shaping up to be another solid release—thanks in part to the inclusion of 3D-era titles that help keep things feeling fresh.\"\n\"If the rest of Capcom Fighting Collection 2 is as polished and... [1772 chars]"
            },
            {
                "title": "Noise Cancelling Headphones",
                "description": "‘O’ Edition MKII Noise Cancelling Headphones from Orange have been developed for fully personalised, high-fidelity audio. With a new ...",
                "content": "Words by Mixdown staff\n‘O’ Edition MKII Noise Cancelling Headphones from Orange have been developed for fully personalised, high-fidelity audio. With a new range of customizable features, they put the user in complete control of their listening exper... [1435 chars]"
            },
            {
                "title": "Why Is Google’s Pixel 9a The New Template For A Successful Smartphone?",
                "description": "While the Pixel 9a will be seen as a win for consumers, it can also be seen as Google defining what it means to be a mid-range smartphone.",
                "content": "Google's Pixel 9a Ewan Spence\nGoogle’s Pixel 9a is picking up critical acclaim, with many noting that offering the phone at $499 marks the 9a as one of the leading mid-range smartphones. While the Pixel 9a will be seen as a win for consumers, it will... [6453 chars]"
            },
            {
                "title": "Runway AI’s Gen-4: How Can AI Montage Go Beyond Absurdity",
                "description": "AI video start-up Runway AI, now valued at $3 billion, attracts a slew of collaborations from film studios. But can AI films create stories that stick?",
                "content": "NEW YORK, NEW YORK - MAY 09: (L-R) Jane Rosenthal and Cristobal Valenzuela speak onstage during the ... More 2024 AI Film Festival New York Panel at Metrograph on May 09, 2024 in New York City. (Photo by Dia Dipasupil/Getty Images) Getty Images\nThe r... [6790 chars]"
            },
            {
                "title": "Puma's High-Tech New Supershoe Is the Best We've Seen Yet",
                "description": "The new Fast-R Nitro Elite 3 is finally here—and it's poised to become the best supershoe on the market by a significant margin.",
                "content": "New perk: Easily find new routes and hidden gems, upcoming running events, and more near you. Your weekly Local Running Newsletter has everything you need to lace up! Subscribe today .\nThe Nike Vaporfly 4% wasn’t shy about how much of a boost it clai... [10223 chars]"
            },
            {
                "title": "2FM Alternative with Dan Hegarty Tuesday 15 April 2025",
                "description": "This week's visit to the Session Archives brings us session tracks from Host (2019), The Young Offenders (1996), and First Class & Coach (2020).\nPlaylist - The Alternative (with Dan Hegarty) - Tuesday, April 15:\nFontaines D.C. - 'Starburster'\nGENN - ‘Rohmeresse’\nU2 - ‘Even Better Than The Real Thing’ (Fish Out Of Water Mix)\nMarathon - ‘DH22’\nMolly V…",
                "content": "This week's visit to the Session Archives brings us session tracks from Host (2019), The Young Offenders (1996), and First Class & Coach (2020).\nPlaylist - The Alternative (with Dan Hegarty) - Tuesday, April 15:\nFontaines D.C. - 'Starburster'\nGENN - ... [524 chars]"
            },
            {
                "title": "An Taobh Tuathail Dé Máirt 15 Aibreán 2025",
                "description": "Dé Máirt 15.04.25\nTuesday 15.04.25\ndepeche mode / waiting for the night / mute\nmu-ziq / 4am / balmat\nsilver y / self / bytes\ndj koze / unbelievable (feat ada) / pampa\nanne maree barry / all alone / annemareebarry.bandcamp.com\nultan o'brien / death doula meet / ultanobrien.bandcamp.com\nnico georis / who knows the path / leaving records\ncole pulice / fragmen…",
                "content": "Dé Máirt 15.04.25\nTuesday 15.04.25\ndepeche mode / waiting for the night / mute\nmu-ziq / 4am / balmat\nsilver y / self / bytes\ndj koze / unbelievable (feat ada) / pampa\nanne maree barry / all alone / annemareebarry.bandcamp.com\nultan o'brien / death do... [1064 chars]"
            },
            {
                "title": "Simple steps for pet businesses to dominate local online visibility",
                "description": "Carl Jones from Local Manager explains how pet businesses can ensure their business appears at the top of local search listings online.",
                "content": "Carl Jones from Local Manager explains how pet businesses can ensure their business appears at the top of local search listings online.\nForty-six per cent of all small animal searches online in Australia are related to local businesses. More than 80 ... [3218 chars]"
            },
            {
                "title": "Active mum had leg amputated while awake after running pain in knee turned out to be peach-sized tumour",
                "description": "A mother-of-four was forced to have her leg amputated while conscious after knee pain she experienced when running turned out to be a benign tumour the size of ...",
                "content": "A mother-of-four was forced to have her leg amputated while conscious after knee pain she experienced when running turned out to be a benign tumour the size of a peach.\nCamilla Collins, 45, who lives in Camberley, Surrey, with her husband, Henry, 46,... [5799 chars]"
            }
        ]
    },
    {
        "14": [
            {
                "title": "Android 12 and 12L have received their last official Google security update",
                "description": "These devices won't get the April 2025 security patch, or any future releases.",
                "content": "What you need to know\nGoogle's last official security patch for Android 12 and Android 12L was the March 2025 update.\nAs of March 31, 2025, Google is no longer supporting the Android 12 and 12L operating systems.\nOEMs can still choose to manually bac... [1967 chars]"
            },
            {
                "title": "Zero silica, maximum appeal",
                "description": "Cosentino’s latest stone surfacing product, engineered especially for the Australian market, takes the trifecta: it’s stylish, safe and sustainable.",
                "content": "In July last year, Australia became the first country in the world to implement a ban on the supply, manufacture and installation of engineered stone products containing 1% or more crystalline silica. This represents a huge step forward in improving ... [832 chars]"
            },
            {
                "title": "Get the Samsung 27-Inch Curved Monitor for just $188: Perfect for work, gaming and entertainment",
                "description": "‘Excellent screen set up.’",
                "content": "This Samsung S36GD Curved Monitor, featuring a 27-inch display is perfect for both work and play, it’s also currently on sale on Amazon Australia for an incredible deal.\nThe monitor was $269 but is now reduced to $188 for a limited-time only and comb... [2262 chars]"
            },
            {
                "title": "Marvel vs. Capcom: Fighting Collection Scores A New Switch Update This Week",
                "description": "Fight on! - Capcom's second fighting collection is just around the corner, but ahead of this it's actually announced a title update for the Marvel vs. Capcom...",
                "content": "Subscribe to Nintendo Life on YouTube 808k\nCapcom's second fighting collection is just around the corner, but ahead of this it's actually announced a title update for the Marvel vs. Capcom Fighting Collection.\nIt will be arriving this week on 16th Ap... [1777 chars]"
            },
            {
                "title": "Google Launches AI to Decode Dolphin Talk, Runs on Pixel Phones",
                "description": "Marine biologists can now use Google's DolphinGemma to analyze clicks and whistles, potentially bridging the gap between species",
                "content": "Decrypt’s Art, Fashion, and Entertainment Hub. Discover SCENE\nWhy try to understand Gen Z slang when it might be easier to communicate with animals?\nToday, Google unveiled DolphinGemma, an open-source AI model designed to decode dolphin communication... [4881 chars]"
            },
            {
                "title": "Microsoft AI CEO: ‘It’s Smarter to Be 6 Months Behind’ - Here’s Why",
                "description": "Microsoft’s AI chief says trailing the frontier is a smarter strategy. By staying behind OpenAI, Microsoft aims for cost-efficiency and long-term self-sufficiency.",
                "content": "At a time when tech giants are racing to build the most powerful AI models on the planet, Microsoft is choosing a different lane — one that’s a little slower but potentially smarter.\nMustafa Suleyman, Microsoft’s CEO of AI, says the company isn’t in ... [3271 chars]"
            },
            {
                "title": "SAS veteran to mark decade since he was given 10 years to live with 137km cycle after tooth removal unveiled rare cancer",
                "description": "An SAS veteran given 10 years to live after a wisdom tooth removal led to a rare cancer diagnosis is preparing for a mammoth bike ride to celebrate reaching the...",
                "content": "An SAS veteran given 10 years to live after a wisdom tooth removal led to a rare cancer diagnosis is preparing for a mammoth bike ride to celebrate reaching the decade milestone.\nBob Perry, 70, from Poole, Dorset, previously served in the Army and th... [6522 chars]"
            },
            {
                "title": "This Year's Cairns Crocodiles Pinterest Welcome Party Is Serving Looks & Cherry-Coded Vibes!",
                "description": "Get ready to paint the town cherry—because the 2025 Cairns Crocodiles Pinterest Welcome Party is going full tilt into one of Pinterest Predicts’ hottest trends: Cherry Coded.",
                "content": "Get ready to paint the town (cherry) red—because the 2025 Cairns Crocodiles Pinterest Welcome Party is going full tilt into one of Pinterest Predicts’ hottest trends: Cherry Coded!\nThis year’s theme will have every stylish soul heading to Tropical No... [1303 chars]"
            },
            {
                "title": "Dragon Age And Mass Effect Teams Didn't Get Along At BioWare, Former Dev Says",
                "description": "According to former lead writer David Gaider, tension between dev teams led to friction at BioWare.",
                "content": "Former Dragon Age series lead writer David Gaider says that during his later years at BioWare, the studio's Dragon Age team and the Mass Effect team did not get along--nor did the team making Anthem.\n\"For a long time it was basically two teams under ... [2800 chars]"
            },
            {
                "title": "Google rolling out auto-restart security feature to Android",
                "description": "With the latest Play services update, Google is rolling out a new auto-reboot security feature that automatically restarts Android devices...",
                "content": "With the latest Google Play services update, Android is rolling out a new security feature that automatically restarts (or auto-reboots) devices that have been “locked for 3 consecutive days.”\nUnder Security & Privacy, the release notes for version 2... [1529 chars]"
            }
        ]
    }
]