[
    {
        "16": [
            {
                "title": "Colossal squid filmed in deep-sea natural habitat for the first time, but it's just a juvenile",
                "description": "New footage filmed 600 metres below the surface of the Southern Atlantic Ocean shows rare juvenile from world's heaviest squid species.",
                "content": "The world's heaviest squid has been caught on video in its natural deep ocean habitat for the first time.\nWell, a tiny \"teenage\" specimen of the colossal squid (Mesonychoteuthis hamiltoni) that measured 30 centimetres-long.\nBut one day the delicate c... [6869 chars]"
            },
            {
                "title": "Fifty years on, New Zealand’s tribunal upholding Māori rights faces a turning point",
                "description": "The Waitangi Tribunal has had a significant impact on Indigenous rights and policy but as it marks its 50th anniversary, its role is being questioned",
                "content": "In the 1980s, New Zealand’s department of Māori affairs set aside money for language groups to spend on projects as they saw fit. When Wellington teacher Huirangi Waikerepuru received his group’s share, he used it to challenge the government.\nHe took... [7941 chars]"
            },
            {
                "title": "Island-wide blackout hits Puerto Rico as residents prepare for Easter weekend",
                "description": "An island-wide blackout hit Puerto Rico on Wednesday as the largely Catholic residents of the U.S. territory prepared to celebrate the Easter weekend, officials said.",
                "content": "San Juan, Puerto Rico (AP) — An island-wide blackout hit Puerto Rico on Wednesday as the largely Catholic residents of the U.S. territory prepared to celebrate the Easter weekend, officials said.\nAll 1.4 million clients on the island were without pow... [4097 chars]"
            },
            {
                "title": "Island-wide blackout hits Puerto Rico as residents prepare for Easter weekend",
                "description": "An island-wide blackout has hit Puerto Rico as the largely Catholic residents of the U.S. territory prepared to celebrate the Easter weekend.",
                "content": "SAN JUAN, Puerto Rico (AP) — An island-wide blackout hit Puerto Rico on Wednesday as the largely Catholic residents of the U.S. territory prepared to celebrate the Easter weekend, officials said.\nAll 1.4 million clients on the island were without pow... [4497 chars]"
            },
            {
                "title": "Trump reports 'big progress' in tariff talks with Japanese officials",
                "description": "WASHINGTON: President Donald Trump said there was \"big progress\" when he made the surprise move on Wednesday (Apr 16) to negotiate directly with Japanese officials about the barrage of tariffs h",
                "content": "WASHINGTON: President Donald Trump said there was \"big progress\" when he made the surprise move on Wednesday (Apr 16) to negotiate directly with Japanese officials about the barrage of tariffs he has imposed on global imports.\n\"A Great Honour to have... [1814 chars]"
            },
            {
                "title": "YourUpdateTV talks about being True to the Mafia Code Philadelphia Style",
                "description": "**media[597360,597361]**",
                "content": "New book spotlights the life of Notorious Philadelphia Mob Figure Nicodemo \"Little Nicky” Scarfo\nTRUE TO THE CODE : NICODEMO SCARFO gives readers a front row seat to the rise and fall of the Philadelphia Mob Boss\nCo Authors McKinley Horton and Katja ... [8377 chars]"
            },
            {
                "title": "Trump Waved Off Israeli Strike After Divisions Emerged in His Administration",
                "description": "Israel developed plans for attacking Iranian nuclear facilities that would have required U.S. assistance. But some administration officials had doubts.",
                "content": "Israel had planned to strike Iranian nuclear sites as soon as next month but was waved off by President Trump in recent weeks in favor of negotiating a deal with Tehran to limit its nuclear program, according to administration officials and others br... [938 chars]"
            },
            {
                "title": "Iran confirms that the second round of nuclear talks with the U.S. will be in Rome",
                "description": "Iran confirms nuclear talks in Rome, with stakes high as U.S. threatens airstrikes and Iran pursues nuclear weapons.",
                "content": "Iran confirmed Wednesday that the next round of nuclear talks with the United States this weekend will be held in Rome after earlier confusion over where the negotiations would be held.\nThe announcement by Iranian state television came as Iran's Pres... [4554 chars]"
            },
            {
                "title": "Online event with Lorna Gold: Celebrating 10 years of Laudato Si'",
                "description": "It seems hard to believe that 2025 marks the 10th anniversary of the groundbreaking and influential Papal encyclical letter, Laudato Si' - On Care for Our Common Home. This will be marked by an interactive webinar on Wednesday 23 April from 7.30-9pm, with speakers including Lorna Gold, ...",
                "content": "Source: Focolare GB Integral Ecology Group\nIt seems hard to believe that 2025 marks the 10th anniversary of the groundbreaking and influential Papal encyclical letter, Laudato Si' - On Care for Our Common Home. This will be marked by an interactive w... [3328 chars]"
            },
            {
                "title": "YourUpdateTV talks about being True to the Mafia Code",
                "description": "New book spotlights the life of Notorious Philadelphia Mob Figure Nicodemo “Little Nicky” Scarfo TRUE TO THE CODE : NICODEMO SCARFO gives readers a...",
                "content": "New book spotlights the life of Notorious Philadelphia Mob Figure Nicodemo “Little Nicky” Scarfo\nTRUE TO THE CODE : NICODEMO SCARFO gives readers a front row seat to the rise and fall of the Philadelphia Mob Boss\nCo Authors McKinley Horton and Katja ... [8097 chars]"
            }
        ]
    },
    {
        "15": [
            {
                "title": "19 Big Cats Rescued in Spain as Police Raid Animal Smuggling Ring",
                "description": "With a demand for exotic felines on the rise, often driven by social media, endangered and protected populations are under even more threat.",
                "content": "The Spanish police say they rescued 19 exotic felines from a home on the island of Majorca that were bound for sale on the growing illegal world market for big cats, and they arrested the Russian couple who owned them.\nWith demand for large felines l... [799 chars]"
            },
            {
                "title": "Trump says Harvard a ‘joke’ undeserving of US federal funding",
                "description": "WASHINGTON: US President Donald Trump doubled down Wednesday on a funding standoff with top university Harvard that...",
                "content": "WASHINGTON: US President Donald Trump doubled down Wednesday on a funding standoff with top university Harvard that has become a focal point of his war against elite educational institutions.\nHarvard has stood out for defying Trump’s attempts to forc... [1544 chars]"
            },
            {
                "title": "USCIS Biometric Rule: What Indian Visa Holders In The US Need To Know",
                "description": "A new biometric registration rule introduced by the US Citizenship and Immigration Services (USCIS) has caused confusion among Indian nationals living in the US. But immigration experts say that the changes mainly apply to undocumented individuals and not to those with valid visas., US News News - Times Now",
                "content": "Representative Image Photo : iStock\nA new biometric registration rule introduced by the US Citizenship and Immigration Services ( USCIS ) has caused confusion among Indian nationals living in the US. But immigration experts say that the changes mainl... [2155 chars]"
            },
            {
                "title": "Can Harvard’s billions withstand Trump’s federal funding fight?",
                "description": "The Trump administration has frozen US$2.2 billion in funding and it could lose its tax-exempt status. Read more at straitstimes.com.",
                "content": "The US’ wealthiest college has long hoarded cash and built its budget to withstand “shocks” as the Ivy League school put it in its financial statement. PHOTO: AFP\nHarvard University’s balance sheet – fortified to withstand surprise blows – is facing ... [5323 chars]"
            },
            {
                "title": "Trump administration slammed by judge for doing 'nothing' to retrieve man wrongly deported to El Salvador",
                "description": "A judge who ruled that Kilmar Abrego Garcia was wrongfully deported to El Salvador last month has slammed the Trump administration for doing \"nothing\" to facilitate his return.",
                "content": "A judge in the United States has slammed the Trump administration for doing \"nothing\" to facilitate the return of a man it wrongly deported to El Salvador last month.\nKilmar Abrego Garcia has now spent exactly one month in a notorious El Salvador pri... [5981 chars]"
            },
            {
                "title": "5.6-magnitude quake rattles southern Philippines",
                "description": "MANILA: A magnitude 5.6 earthquake struck off the southern Philippines on Wednesday (Apr 16), the United States Geological Survey (USGS) said, with no immediate reports of damage or casualties. The quake off the coast of the island of Mindanao had a depth of 30km, the USGS added. The Philipp",
                "content": "MANILA: A magnitude 5.6 earthquake struck off the southern Philippines on Wednesday (Apr 16), the United States Geological Survey (USGS) said, with no immediate reports of damage or casualties.\nThe quake off the coast of the island of Mindanao had a ... [849 chars]"
            },
            {
                "title": "Trump orders tariff probe on all U.S. critical mineral imports",
                "description": "U.S. President Donald Trump has ordered a probe into potential new tariffs on all U.S. critical minerals imports.",
                "content": "U.S. President Donald Trump on Tuesday ordered a probe into potential new tariffs on all U.S. critical minerals imports, a major escalation in his dispute with global trade partners and an attempt to directly rebuke industry leader China.\nThe order l... [2214 chars]"
            },
            {
                "title": "‘De-extinction’ of dire wolves promotes false hope: technology can’t undo extinction",
                "description": "Claims of ‘bringing back’ any species take away focus from proven solutions that can actually fix the extinction crisis.",
                "content": "Over the past week, the media have been inundated with news of the “de-extinction” of the dire wolf (Aenocyon dirus) – a species that went extinct about 13,000 years ago.\nThe breakthrough has been achieved by Colossal Biosciences, a multibillion-doll... [4458 chars]"
            },
            {
                "title": "Mahdawi’s Israeli Colleague Undermines Rubio Antisemitism Case",
                "description": "Mohsen Mahdawi’s Israeli colleague undermines Marco Rubio’s antisemitism case to detain and deport the Columbia University student.",
                "content": "An Israeli associate of Mohsen Mahdawi, the Columbia University student detained Monday by U.S. Immigration and Customs Enforcement, said his targeting is a clear sign that no kind of activism in support of Palestine — even efforts to build peace wit... [6795 chars]"
            },
            {
                "title": "Govt fears trade war may trigger import surge of US farm, Chinese factory goods",
                "description": "Earlier this month a high-level meeting had taken place at the Commerce and Industry Ministry to assess possible import surge as a result of trade diversions in the backdrop of the reciprocal tariffs.",
                "content": "AMID ESCALATING global trade tensions, the Commerce and Industry Ministry is assessing the risks of significant trade diversion from other countries to India and is particularly concerned about the likely surge in imports of US farm produce and facto... [4840 chars]"
            }
        ]
    },
    {
        "14": [
            {
                "title": "Pontins owner charged with corporate manslaughter",
                "description": "Wendy Jones died in hospital about six months after being injured at Pontins Brean Sands, in Somerset.",
                "content": "Pontins owner charged with corporate manslaughter\nWendy Jones, pictured with two of her grandchildren, died after a visit to Pontins Brean Sands\nThe owner of Pontins holiday parks has been charged with corporate manslaughter after an air conditioning... [530 chars]"
            },
            {
                "title": "El Salvador's Bukele rules out returning US deportee",
                "description": "El Salvador President Nayib Bukele said he would not return the man who was deported from the US on an administrative error during a meeting with US President Donald Trump at the Oval Office to discuss their partnership.",
                "content": "El Salvador President Nayib Bukele said he would not return the man who was deported from the US on an administrative error during a meeting with US President Donald Trump at the Oval Office to discuss their partnership.\nEl Salvador's President Nayib... [5702 chars]"
            },
            {
                "title": "‘You Don’t Start a War Against Somebody 20 Times Your Size’ - Trump Again Blames Zelensky for Russian Invasion",
                "description": "Trump simultaneously vowed to punish CBS News via federal regulators for broadcasting an interview with Zelensky that didn’t match his own narrative, on a day spent attacking the non-fawning media.",
                "content": "US President Donald Trump once again promoted his own fictitious account of events in the Russian full-scale invasion of Ukraine, erroneously blaming Zelensky for the death of “millions of people”.\nHe also put US media outlets on notice that they wou... [2778 chars]"
            },
            {
                "title": "What Trump really wants from Canada",
                "description": "Donald Trump's return to the White House has created flashpoints between the North American neighbours.",
                "content": "Machias Seal Island is a tiny dot on maps of North America.\nBut the uninhabited, fogbound rock is significant for its location in an area known as the \"Grey Zone\" – the site of a rare international dispute between Canada and the United States.\nThe tw... [795 chars]"
            },
            {
                "title": "What Trump really wants from Canada",
                "description": "Donald Trump's return to the White House has created flashpoints between the North American neighbours.",
                "content": "What Trump really wants from Canada\n1 hour ago Share Save Anthony Zurcher • @awzurcher Senior North America reporter Share Save\nBBC\nMachias Seal Island is a tiny dot on maps of North America. But the uninhabited, fogbound rock is significant for its ... [12459 chars]"
            },
            {
                "title": "Harvard will fight Trump administration demands over funding",
                "description": "Harvard President Alan Garber wrote in a public letter on Monday that Harvard is resisting demands from the federal Department of Education that threaten \"our values as a private institution devoted to the pursuit, production, and dissemination of knowledge.\"",
                "content": "Harvard President Alan Garber wrote in a public letter on Monday that Harvard is resisting demands from the federal Department of Education that threaten \"our values as a private institution devoted to the pursuit, production, and dissemination of kn... [2950 chars]"
            },
            {
                "title": "Indian-origin surgeon killed in New York plane crash with husband, 2 children. Who was Dr Joy Saini?",
                "description": "Dr Joy Saini was born in Punjab, India, and moved to the United States with her parents. She trained in medicine at the University of Pittsburgh, where she met her husband Michael Groff.",
                "content": "A tragic plane crash in upstate New York has claimed the lives of six people, including Dr Joy Saini, an Indian-origin surgeon, her neurosurgeon husband, their two adult children and their partners. The incident occurred on Saturday as the group were... [3160 chars]"
            },
            {
                "title": "Area presidency assignments for 2025-26 announced",
                "description": "The Church has 24 administrative areas — six that cover the United States and the remaining 18 covering other countries.",
                "content": "Area leadership assignments in The Church of Jesus Christ of Latter-day Saints for 2025-26 were announced Monday, April 14.\nThe First Presidency of The Church of Jesus Christ of Latter-day Saints has announced the Church’s 2025-2026 area leadership a... [338 chars]"
            },
            {
                "title": "US edges closer to constitutional crisis over wrongly deported man",
                "description": "Veteran Democrat Nancy Pelosi is among those accusing the Trump administration of defying the courts by refusing to return a man from a notorious Salvadorian jail.",
                "content": "Washington: The US is edging closer to a constitutional crisis over a man wrongly deported to a notorious Salvadorian prison, with the Trump administration resisting a Supreme Court order to “facilitate” the man’s return to the United States.\nBoth Tr... [962 chars]"
            },
            {
                "title": "City Hall cracks down on illegal alfresco dining",
                "description": "KUALA Lumpur City Hall (DBKL) is declaring war on eateries that turn public walkways into private dining areas.",
                "content": "KUALA Lumpur City Hall (DBKL) is declaring war on eateries that turn public walkways into private dining areas.\nIn a written reply to StarMetro, DBKL said it had launched a full-scale crackdown, with 24 targeted enforcement operations annually, aimed... [3760 chars]"
            }
        ]
    }
]