[
    {
        "2025-04-19": [
            {
                "title": "Hereditary Lords face up to extinction",
                "description": "Lords who inherited their titles share their mixed feelings about being ejected from the Upper Chamber.",
                "content": "'Route to ignominy': Hereditary Lords on prospect of leaving parliament\n4 hours ago Share Save Kate Whannel Political reporter Share Save\nGetty Images\nImprisoned in the Tower of London in 1538 waiting to be executed, Henry Courtenay, the Earl of Devo... [6288 chars]"
            },
            {
                "title": "US-Iran nuclear talks to resume April 26 after 'very good progress' in Rome",
                "description": "US News: The US and Iran are gearing up for another round of nuclear talks in Oman on April 26, buoyed by \"very good progress\" made in Rome. US envoy Steve Wit",
                "content": "Foreign Minister Abbas Araghchi (R) with International Atomic Energy Agency (IAEA) Director General Rafael Mariano Grossi (L)- AP file photo\nBREAKING: US resumes nuclear weapons talks with Iran\nThe United States and Iran are preparing for a second ro... [1547 chars]"
            },
            {
                "title": "Trans rights supporters rally in London after UK Supreme Court ruling",
                "description": "Trans rights protesters gather in the English capital to protest against the UK's Supreme Court ruling that a woman is someone born biologically female.",
                "content": "Thousands of trans rights protesters have gathered in central London days after the UK's Supreme Court ruled that a woman is someone born biologically female and that transgender women are excluded from that legal definition.\nWith unease growing over... [2819 chars]"
            },
            {
                "title": "Inside Elon Musk's government-subsidised free-trade Texas HQ",
                "description": "The tycoon and Donald Trump advisor has moved his businesses from California to a mostly rural central Texas county. What do the neighbours think?",
                "content": "After fleeing Silicon Valley for political and business reasons, Elon Musk is building a corporate campus in rural Texas – but his new neighbours have mixed views.\nHalf an hour east of Austin, past the airport, the clogged-up traffic starts to melt a... [1739 chars]"
            },
            {
                "title": "Inside Elon Musk's government-subsidised free-trade Texas HQ",
                "description": "The tycoon and Donald Trump advisor has moved his businesses from California to a mostly rural central Texas county. What do the neighbours think?",
                "content": "Inside Elon Musk's government-subsidised Texas headquarters\n2 hours ago Share Save Mike Wendling @mwendling Reporting from Bastrop, Texas Share Save\nGetty Images The site pictured in 2023, with SpaceX facilities at the top, The Boring Company located... [8285 chars]"
            },
            {
                "title": "Many in the autism community says RFK Jr. is pushing harmful and regressive rhetoric about who they are",
                "description": "“These are kids who will never pay taxes. They’ll never hold a job. They’ll never play baseball. They’ll never write a poem. They’ll never go out on a date. Many of them will never use a toilet unassisted,” HHS Secretary Robert F. Kennedy said of people with autism.",
                "content": "CNN —\nAlison Singer has a few people she’d like Robert F. Kennedy Jr. to meet.\nSinger’s brother and daughter are two of the millions living with autism in the United States, and part of a much larger community that has very publicly expressed feeling... [7861 chars]"
            },
            {
                "title": "Police algorithm said Lina was at 'medium' risk. Then she was killed",
                "description": "Spanish police use an algorithm to assess the risk of repeat domestic violence. Does it work?",
                "content": "In January, Lina went to the police.\nHer ex-partner had been threatening her at home in the Spanish seaside town of Benalmádena. That day, he'd allegedly raised his hand as if to hit her.\n\"There had been violent episodes - she was scared,\" Lina's cou... [846 chars]"
            },
            {
                "title": "Then she was killed",
                "description": "Spanish police use an algorithm to assess the risk of repeat domestic violence. Does it work?",
                "content": "Police algorithm said Lina was at 'medium' risk. Then she was killed\n2 hours ago Share Save Linda Pressly and Esperanza Escribano BBC News Share Save\nFamily handout Lina died at her home on 9th February, 2025\nIn January, Lina went to the police. Her ... [7183 chars]"
            },
            {
                "title": "Putin declares temporary 'Easter truce' in Ukraine",
                "description": "Ukrainian President Zelenskyy called the proposal \"yet another attempt by Putin to play with human lives.\"",
                "content": "Zelenskyy said Ukraine will engage in a full ceasefire if Russia does.\nPresident Vladimir Putin speaks in this video released by the Kremlin on April 19, 2025.\nPresident Vladimir Putin speaks in this video released by the Kremlin on April 19, 2025.\nP... [3249 chars]"
            },
            {
                "title": "‘Impeach & Remove’: Thousands across US protest against Donald Trump",
                "description": "This is the fourth big wave of protests against US President Donald Trump across America since he took charge of the Oval Office on January 20.",
                "content": "Massive anti-Trump protests began in Washington and several other cities across the United States, as people rallied to raise their voices against President Donald Trump's policies on deportation, government firings and Ukraine, Gaza wars. Protesters... [3265 chars]"
            }
        ]
    },
    {
        "2025-04-18": [
            {
                "title": "Trump says US will soon ‘take a pass’ if Russia or Ukraine baulk on deal",
                "description": "“If for some reason, one of the two parties makes it very difficult, we’re just going to say, you’re foolish,” he told reporters. Read more at straitstimes.com.",
                "content": "US President Donald Trump (left) said he needed to see quick progress for the deal between Ukrainian President Volodymyr Zelensky and Russian President Vladimir Putin. PHOTOS: EPA-EFE, AFP, REUTERS\nTrump says US will soon ‘take a pass’ if Russia or U... [5834 chars]"
            },
            {
                "title": "US senator says 'traumatised' man deported to El Salvador moved to new prison",
                "description": "Senator Chris Van Hollen met Kilmar Abrego Garcia, who was mistakenly deported to the central American country, on Thursday.",
                "content": "Judge holds last-minute hearing over concern about imminent deportations\nAn emergency hearing is being held after a civil rights nonprofit filed a court document claiming dozens of Venezuelans are set to be imminently deported from a detention facili... [1178 chars]"
            },
            {
                "title": "Gaza doctor describes daily struggle after health system collapse",
                "description": "The BBC joins a GP in Gaza as she sees dozens of patients, struggling to treat them with a dwindling supply of drugs.",
                "content": "'It's really hard to have any hope': Gaza doctor describes daily struggle\n4 hours ago Share Save Yolande Knell BBC Middle East Correspondent Share Save\nBBC Dr Sukkar says life in Gaza feels \"like a nightmare that doesn't end\"\nHealthcare in the Gaza S... [4491 chars]"
            },
            {
                "title": "Gaza doctor describes daily struggle after health system collapse",
                "description": "The BBC joins a GP in Gaza as she sees dozens of patients, struggling to treat them with a dwindling supply of drugs.",
                "content": "\"Most of our patients are displaced people,\" Dr Sukkar says. \"They live in shelters, they even live in tents in the streets.\"\nSince a ceasefire collapsed a month ago, thousands of Gazans have once again left their homes and fled to this neighbourhood... [1570 chars]"
            },
            {
                "title": "White House changes COVID.gov web page to page supporting lab leak theory",
                "description": "The site has been directed to a new landing page that argues for the theory that COVID-19 originated from a mistaken lab leak in Wuhan, China.",
                "content": "The website once had resources for vaccines, testing and treatment for COVID-19.\nThe White House has redirected COVID.gov to a new landing page called \" Lab Leak: True Origins of COVID-19, \" which makes a five-point argument for the theory that COVID... [5107 chars]"
            },
            {
                "title": "Mega sale of Penang’s history",
                "description": "GEORGE TOWN: Whole blocks of prime pre-war properties and some vacant land here – all locked in trust deeds for decades – have now been opened for sale in what could be the largest en bloc subsale offer of mature properties in the country.",
                "content": "GEORGE TOWN: Whole blocks of prime pre-war properties and some vacant land here – all locked in trust deeds for decades – have now been opened for sale in what could be the largest en bloc subsale offer of mature properties in the country.\nMany of th... [3814 chars]"
            },
            {
                "title": "Kilmar Abrego Garcia's wife ‘covered’ his knuckle tattoos in old post? Trump says…",
                "description": "Kilmar Abrego Garcia, the Maryland man who was deported to El Salvador last month, was spotted with tattoos on his knuckles",
                "content": "Kilmar Abrego Garcia, the Maryland man who was deported to El Salvador last month, was spotted with tattoos on his knuckles as the 29-year-old met Senator Chris Van Hollen on Thursday. The tattoos have become a point of controversy, with even Preside... [2180 chars]"
            },
            {
                "title": "US canceling Chinese student visas without just cause",
                "description": "Rising geopolitical conflicts and trade wars may affect people-to-people exchanges between the United States and China",
                "content": "Rising geopolitical conflicts and trade wars are affecting people-to-people exchanges between the United States and China as Washington tightens its student visa issuance.\nOver the past month, the Trump administration has reportedly revoked visas of ... [7587 chars]"
            },
            {
                "title": "Why does Putin insist Ukrainians and Russians are ‘one people’?",
                "description": "Russian president Vladimir Putin does not seem interested in peace: Sunday’s missile strike on Sumy, the worst civilian attack this year, proves he is",
                "content": "Russian president Vladimir Putin does not seem interested in peace: Sunday’s missile strike on Sumy, the worst civilian attack this year, proves he is determined to expand into Ukraine at any cost.\nThis is a war of ideas, narratives and myths – one t... [7481 chars]"
            },
            {
                "title": "FinMin to discuss China debt",
                "description": "Hopes to reschedule $3.4b in Chinese debt for two years; discuss IMF loan progress",
                "content": "Listen to article\nPakistan's Finance Minister Muhammad Aurangzeb is expected to take up the issue of rescheduling guaranteed debt with his Chinese counterpart in Washington next week, on the sidelines of the International Monetary Fund's (IMF) spring... [5457 chars]"
            }
        ]
    },
    {
        "2025-04-17": [
            {
                "title": "How much do bin workers get paid?",
                "description": "At the heart of the dispute are the Waste Recycling and Collection Officers, who were paid more than some other bin workers.",
                "content": "How much do bin workers get paid?\n1 hour ago Share Save Gerry Georgieva & Anthony Reuben BBC Verify Share Save\nReuters\nA strike among bin workers in Birmingham has left piles of waste around the city. At the heart of the dispute is the removal of the... [3756 chars]"
            },
            {
                "title": "Alleged UnitedHealthcare CEO killer Luigi Mangione indicted on federal murder charge",
                "description": "The indictment returned by a grand jury also charges Luigi Mangione with two counts of stalking and a firearms count.",
                "content": "Luigi Mangione, the alleged killer of UnitedHealthcare CEO Brian Thompson, has been indicted on a federal murder charge in a necessary step for prosecutors who wish to seek the death penalty.\nThe indictment returned by a grand jury in Manhattan feder... [1978 chars]"
            },
            {
                "title": "Ukraine and U.S. Sign Agreement in Lead-Up to Full Minerals Deal",
                "description": "The signed memorandum of understanding was thin on details, and the White House did not comment. But President Trump has said he expects to sign a minerals deal with Kyiv soon.",
                "content": "Ukraine and the United States signed a memorandum of understanding late on Thursday as a “step toward a joint economic partnership agreement,” according to Ukraine’s economy minister, bringing both sides closer to a minerals deal that has gone throug... [668 chars]"
            },
            {
                "title": "A US man hijacks a small plane in Belize and stabs people. He is fatally shot and plane lands safely",
                "description": "A U.S. man has been fatally shot after he hijacked a small passenger plane in Belize. That's according to officials in Belize and the U.S.",
                "content": "MEXICO CITY (AP) — A U.S. man hijacked a small plane in Belize on Thursday, stabbing two passengers and a pilot, before one of the stabbed passengers fatally shot him, officials in Belize and the United States said. The plane then landed safely.\nThe ... [2783 chars]"
            },
            {
                "title": "Migrant tents removed from Guantanamo Bay, satellite images show",
                "description": "Some 175 tents raised as part of an expansion to the base's migrant detention centre have been removed.",
                "content": "Migrant tents removed from Guantanamo bay, satellite images show\n9 hours ago Share Save Benedict Garman & Matt Murphy BBC Verify Share Save\nKristi Noem An image posted by Homeland Security Secretary Kristi Noem showing rows of tents at Guantanamo Bay... [1568 chars]"
            },
            {
                "title": "Migrant tents removed from Guantanamo Bay, satellite images show",
                "description": "Some 175 tents raised as part of an expansion to the base's migrant detention centre have been removed.",
                "content": "Subsequent lower resolution images show that as of 16 April a total of around 175 tents appeared to have been taken down.\nIt's unclear how many migrants remain at the facility. Stephen Miller - the White House deputy chief of staff - insisted in an i... [1767 chars]"
            },
            {
                "title": "Read a Federal Appeals Panel’s Sharp Rebuke of the Trump Administration",
                "description": "A federal appeals court in Virginia issued a striking opinion on Thursday, reaffirming that the Trump administration had to take a more active approach in seeking the release of a Maryland man, Kilmar Armando Abrego Garcia.",
                "content": "‘This Should Be Shocking:’ Read a Federal Appeals Panel’s Sharp Rebuke of the Trump Administration\nA federal appeals court in Virginia issued a striking opinion on Thursday, reaffirming that the Trump administration had to take a more active approach... [961 chars]"
            },
            {
                "title": "Trump signals US-China tariff hikes may be near end; TikTok deal on hold",
                "description": "US President Trump confident in US-China tariff talks, hints at communication with Xi Jinping, optimistic about resolving trade war.",
                "content": "U.S. President Donald Trump on Thursday (April 18, 2025) signalled a potential end to the tit-for-tat tariff hikes between the U.S. and China that shocked markets, and that a deal over the fate of social media platform TikTok may have to wait.\n“I don... [1802 chars]"
            },
            {
                "title": "Luigi Mangione indicted in Brian Thompson murder, faces death penalty if convicted",
                "description": "Luigi Mangione has been indicted on a federal murder charge in the killing of UnitedHealthcare CEO Brian Thompson. He also faces separate state murder charges.",
                "content": "NEW YORK (AP) — Luigi Mangione was indicted Thursday on a federal murder charge in the killing of UnitedHealthcare CEO Brian Thompson, a necessary step for prosecutors to seek the death penalty. Luigi Mangione is accused of killing UnitedHealth Group... [1665 chars]"
            },
            {
                "title": "FSU shooting live updates: Shooter Phoenix Ikner had access to officer mother's gun",
                "description": "FSU shooting live updates: The university has issued an emergency alert, urging all students, faculty, and staff to shelter in place immediately.",
                "content": "FSU shooting live updates: A horrific situation unfolded in the United States' Florida on Thursday afternoon as an active shooter was reported on the campus of Florida State University, triggering an immediate emergency response, reported AP. The uni... [661 chars]"
            }
        ]
    }
]